#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбновлениеДанныхКниг.ДатаОбновления КАК ДатаОбновления
		|ИЗ
		|	РегистрСведений.ОбновлениеДанныхКниг КАК ОбновлениеДанныхКниг
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОбновления УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбновитьСтарше = ВыборкаДетальныеЗаписи.ДатаОбновления;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьИндекс(Команда)
	СформироватьИндексНаСервере(ОбновлятьКартинкиЦеликом);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере(ОбновитьСтарше, ОбновлятьКартинкиЦеликом);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СформироватьИндексНаСервере(ОбновлятьКартинкиЦеликом)
	МетодыСайтаСервер.СформироватьIndex();
	МетодыСайтаСервер.СформироватьДанные(ОбновлятьКартинкиЦеликом);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьДанныеНаСервере(ОбновитьСтарше, ОбновлятьКартинкиЦеликом)
	
	
	МетодыСайтаСервер.СформироватьКниги(ОбновитьСтарше, ОбновлятьКартинкиЦеликом);
	СформироватьИндексНаСервере(ОбновлятьКартинкиЦеликом);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСайтмапНаСервере()
	МетодыСайтаСервер.СформироватьСайтмап();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСайтмап(Команда)
	ОбновитьСайтмапНаСервере();
КонецПроцедуры

#КонецОбласти












