#Область ОбработчикиСобытий

Функция tgbotlogIn(Запрос)    
    
    Возврат МетодыApiСайта.tgbotlogIn(Запрос);
    
КонецФункции

Функция vklogintakeData(Запрос)
        
    Возврат МетодыApiСайта.vklogintakeData(Запрос);
    
КонецФункции

Функция vkbottakeData(Запрос)
    
    Возврат МетодыApiСайта.vkbottakeData(Запрос);
    
КонецФункции

Функция takeStartsendData(Запрос)
    
    Возврат МетодыApiСайта.takeStartsendData(Запрос);
    
КонецФункции

Функция vkbotcallBack(Запрос)    
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;    
КонецФункции

Функция tgbotgetLog(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция takeStartcallBack(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция tgbotcallBack(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция vklogincallBack(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

Функция vkbotcors(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
КонецФункции

#КонецОбласти
