#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список1.Обновить();
КонецПроцедуры

#Если Не ВебКлиент Тогда
&НаКлиенте
Процедура Запостить(Команда)
	
	ТД = Элементы.Список1.ТекущиеДанные;
	
	ПоляЗаписи = Новый Структура;
	ПоляЗаписи.Вставить("Дата"		, ТД.Период);
	ПоляЗаписи.Вставить("Пост"		, ТД.Ссылка); 
	ПоляЗаписи.Вставить("Автор"		, ТД.Автор);
	ПоляЗаписи.Вставить("Вид"		, ТД.Вид);
	
	ЗапоститьНаСервере(ПоляЗаписи);
	ОткрытьЗначение(ПоляЗаписи.Пост);
		
КонецПроцедуры
#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗапоститьНаСервере(ПоляЗаписи, ТолькоВК = Ложь, ТолькоТГ = Ложь)
	
	
	Запись = РегистрыСведений.ПорядокПостов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПоляЗаписи);
	Запись.ДатаПубликации = ТекущаяДатаСеанса();
	Запись.Опубликован = Истина;
	Запись.Записать(Истина);  
	
	Если Не ТолькоТГ Тогда
		ВК_Действия.Запостить(ПоляЗаписи.Пост,, ПоляЗаписи.Пост.Сообщество);
	КонецЕсли;
	
	Если Не ТолькоВК Тогда
		ТГ_Действия.СоздатьПост(ПоляЗаписи.Пост,, ПоляЗаписи.Пост.Сообщество);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Список1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	#Если Не ВебКлиент Тогда
	ОткрытьЗначение(Элементы.Список1.ТекущиеДанные.Ссылка);	
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Попытка
	Список1.Параметры.УстановитьЗначениеПараметра("Автор", Элементы.Список.ТекущиеДанные.Автор);
	Исключение КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список1.Параметры.УстановитьЗначениеПараметра("Автор", Неопределено);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВОчередьНаСервере(Пост)
	
	ОбъектПост = Пост.ПолучитьОбъект();
	ОбъектПост.Дата = ТекущаяДатаСеанса();
	ОбъектПост.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
КонецПроцедуры

&НаКлиенте
Процедура ВОчередь(Команда)
	ВОчередьНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	Элементы.Список1.Обновить();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗапоститьВК(Команда)
	
	ТД = Элементы.Список1.ТекущиеДанные;
	
	ПоляЗаписи = Новый Структура;
	ПоляЗаписи.Вставить("Дата"		, ТД.Период);
	ПоляЗаписи.Вставить("Пост"		, ТД.Ссылка); 
	ПоляЗаписи.Вставить("Автор"		, ТД.Автор);
	ПоляЗаписи.Вставить("Вид"		, ТД.Вид);
	
	ЗапоститьНаСервере(ПоляЗаписи, Истина);

КонецПроцедуры

&НаСервере
Процедура СообществоПриИзмененииНаСервере()
	
	Список.Отбор.Элементы.Очистить();
	Список1.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сообщество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Сообщество;  
	
	ЭлементОтбора = Список1.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сообщество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Сообщество;   
КонецПроцедуры

&НаКлиенте
Процедура СообществоПриИзменении(Элемент)
	СообществоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РаспределитьПостыНаСервере(Сообщество)
	Документы.Пост.РаспределитьКонтент(Сообщество);
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПосты(Команда)
	РаспределитьПостыНаСервере(Сообщество);
КонецПроцедуры

&НаКлиенте
Процедура ЗапоститьТГ(Команда)
	
	ТД = Элементы.Список1.ТекущиеДанные;
	
	ПоляЗаписи = Новый Структура;
	ПоляЗаписи.Вставить("Дата"		, ТД.Период);
	ПоляЗаписи.Вставить("Пост"		, ТД.Ссылка); 
	ПоляЗаписи.Вставить("Автор"		, ТД.Автор);
	ПоляЗаписи.Вставить("Вид"		, ТД.Вид);
	
	ЗапоститьНаСервере(ПоляЗаписи,, Истина);

КонецПроцедуры

#КонецОбласти


