#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписьВЛог(Знач Данные, Знач Входной) Экспорт
	
	Попытка	
		МЗ = РегистрыСведений.Логирование.СоздатьМенеджерЗаписи();
		МЗ.Период	= ТекущаяДатаСеанса();
		МЗ.Данные 	= РазборЗначенияОтТипа(Данные);
		МЗ.Ключ		= Строка(Новый УникальныйИдентификатор);
		МЗ.Вид		= ?(Входной
		, Перечисления.ВидДанныхЛогирования.Входные
		, Перечисления.ВидДанныхЛогирования.Выходные);
		
		МЗ.Записать();
		
	Исключение 
		ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти


Функция СтруктураТекстом(Знач Структура) 
	
	ДанныеСтрокой = "";
	
	Для Каждого ЭлементДанных Из Структура Цикл
		
		ДанныеСтрокой = ДанныеСтрокой
		+ Символы.Таб
		+ "Ключ:"
		+ Символы.ПС
		+ Символы.ПС
		+ Символы.Таб
		+ Строка(ЭлементДанных.Ключ)
		+ Символы.ПС
		+ Символы.ПС
		+ Символы.Таб
		+ "Значение: "
		+ Символы.ПС
		+ Символы.ПС
		+ Символы.Таб
		+ РазборЗначенияОтТипа(ЭлементДанных.Значение)
		+ Символы.ПС
		+ Символы.ПС
		+ Символы.Таб
		+ "---------------------"
		+ Символы.ПС
		+ Символы.ПС;
		
	КонецЦикла;
	
	Возврат ДанныеСтрокой;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Функция МассивТекстом(Знач Массив) 
	
	ДанныеСтрокой = "";
	
	Для Каждого ЭлементДанных Из Массив Цикл
		
		ДанныеСтрокой = ДанныеСтрокой
		+ Символы.Таб
		+ РазборЗначенияОтТипа(ЭлементДанных)
		+ Символы.ПС
		+ Символы.ПС
		+ Символы.ПС;
		
	КонецЦикла;

	Возврат ДанныеСтрокой;
	
КонецФункции

Функция РазборЗначенияОтТипа(Знач Значение)
	
	Если ТипЗнч(Значение) = Тип("Структура") 
		Или ТипЗнч(Значение) = Тип("Соответствие") Тогда
		
		Возврат СтруктураТекстом(Значение);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Возврат МассивТекстом(Значение);
		
	Иначе
		
		Возврат Строка(Значение);
		
	КонецЕсли;
		
КонецФункции

#КонецОбласти