
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		КартинкаДР    = МетодыОбработкиИзображений.СформироватьКартинкуДняРождения(Объект.Ссылка);		
		ПутьККартинке = ПоместитьВоВременноеХранилище(КартинкаДР, Новый УникальныйИдентификатор);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкаОткрытие(Элемент, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ИнструментарийКлиент.ЗаписатьФайлВРеквизит(Объект.Ссылка, ЭтотОбъект, "Фото", "ПутьКФото"); 

КонецПроцедуры

&НаКлиенте
Процедура ПортретОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнструментарийКлиент.ЗаписатьФайлВРеквизит(Объект.Ссылка, ЭтотОбъект, "КартинкаДвоичные", "Портрет");
	
КонецПроцедуры

#КонецОбласти