#Область ПрограммныйИнтерфейс
#Если НаСервере Тогда
	
// Записать сообщение диалога.
// 
// Параметры:
//  Отправитель - СправочникСсылка.Пользователи - Отправитель
//  Получатель - СправочникСсылка.Пользователи - Получатель
//  СоцСеть - ПеречислениеСсылка.СоцСети - Соц сеть
//  Текст - Строка - Текст сообщения
Процедура ЗаписатьСообщениеДиалога(Знач Отправитель, Знач Получатель, Знач СоцСеть, Знач Текст) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Диалоги.UID КАК UID
		|ИЗ
		|	РегистрСведений.Диалоги КАК Диалоги
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диалоги.UID УБЫВ";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		UID = ВыборкаДетальныеЗаписи.UID + 1;
	Иначе
		UID = 1;
	КонецЕсли;
	
	Я = Справочники.Пользователи.ЭтотПользователь;
	
	Если Отправитель = Я Или Получатель = Я Тогда
		Возврат;
	КонецЕсли;
		
	МЗ = СоздатьМенеджерЗаписи();
	МЗ.UID 			= UID;
	МЗ.Период 		= ТекущаяДатаСеанса();
	МЗ.Отправитель 	= Отправитель;
	МЗ.Получатель	= Получатель;
	МЗ.СоцСеть 		= СоцСеть;
	МЗ.Текст 		= Текст;
	МЗ.Записать(Истина);

КонецПроцедуры

#КонецЕсли
#КонецОбласти