#Область ПрограммныйИнтерфейс
#Если НаСервере Тогда
	
// Записать сообщение диалога.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
//  СоцСеть - ПеречислениеСсылка.СоцСети - Соц сеть
//  Текст - Массив Из Строка - Текст сообщения
Процедура ЗаписатьСообщениеДиалога(Знач Пользователь, Знач СоцСеть, Знач Текст) Экспорт
	
	Я 	= Справочники.Пользователи.ЭтотПользователь;	
	
	Если Пользователь = Я Тогда
		Возврат;
	КонецЕсли;

	Запрос 		= Новый Запрос;
	ТД 			= ТекущаяДатаСеанса();
	ТекстСтрока = "";

	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Диалоги.UID КАК UID
	|ИЗ
	|	РегистрСведений.Диалоги КАК Диалоги
	|
	|УПОРЯДОЧИТЬ ПО
	|	Диалоги.UID УБЫВ";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТД);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		UID = ВыборкаДетальныеЗаписи.UID + 1;
	Иначе
		UID = 1;
	КонецЕсли;
	
	Для Каждого Сообщение Из Текст Цикл
		
		ТекстСтрока = ТекстСтрока 
			+ Сообщение 
			+ Символы.ПС
			+ "##########"
			+ Символы.ПС;
			
	КонецЦикла;
	
	НоваяЗапись					= СоздатьМенеджерЗаписи();
	НоваяЗапись.UID 			= UID;
	НоваяЗапись.Период 			= ТД;
	НоваяЗапись.Пользователь 	= Пользователь;
	НоваяЗапись.СоцСеть 		= СоцСеть;
	НоваяЗапись.Текст 			= ТекстСтрока;
	НоваяЗапись.Записать(Ложь);

КонецПроцедуры

#КонецЕсли
#КонецОбласти