#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КартинкаЛого = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Лого");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Авторизовать(Команда)
	АвторизоватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКомпанию(Команда)
	//@skip-check unknown-method-property
	Объект.ВК_НомерКомпании = СоздатьКомпаниюНаСервере(Объект.Ссылка);
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПутьОткрытие(Команда)
	
	ИнструментарийКлиент.ЗаписатьФайлВРеквизит(Объект.Ссылка, ЭтотОбъект, "Лого");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АвторизоватьНаСервере()
	
	СсылкаАвторизации = МетодыРаботыVK.СоздатьСсылкуПолученияТокена(Объект.ВК_client_id);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьКомпаниюНаСервере(Сообщество)
	
	РеквизитыСообщества = ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Сообщество, "ВК_Кабинет,Наименование");
	IDКабинета 			= РеквизитыСообщества.ВК_Кабинет.ID;
	Возврат МетодыРаботыVK.СоздатьРекламнуюКампанию(
		Сообщество
		, IDКабинета
		, "AIO-" + РеквизитыСообщества.Наименование)["response"][0]["id"];

КонецФункции

#КонецОбласти