#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПапкаСайта 	= Константы.ПапкаСайта.Получить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Собрать(Команда)
	СобратьНаСервере(ПапкаСайта);	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере(ПапкаСайта);
КонецПроцедуры

&НаКлиенте
Процедура Высадка(Команда)
	ВысадкаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СобратьНаСервере(ПапкаСайта)
	МетодыСтатикиСайта.СобратьСайт(ПапкаСайта);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНаСервере(ПапкаСайта)
	Константы.ПапкаСайта.Установить(ПапкаСайта);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВысадкаНаСервере()
	МетодыСтатикиСайта.ВысадитьСайт();
КонецПроцедуры

#КонецОбласти
