Процедура РаспределитьКонтент(Знач Сообщество) Экспорт
	
	КоличествоПостовСообщества 	= 0;
	КоличествоДней				= 0;
	ПостовВДень					= Сообщество.ПостовВДень;
	ДатаПервогоПоста			= Сообщество.ВК_ДатаСоздания;
	МассивДат					= Новый Массив;
	
	Расписание 					= Новый Соответствие;
	Расписание.Вставить(1, 60 * 60 * 21 + 60 * 25); //Один пост в 21.20
	Расписание.Вставить(2, 60 * 60 * 15 + 60 * 10); //Два поста в 15.10 и 21.20
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Пост.Ссылка) КАК Ссылка
		|ИЗ
		|	Документ.Пост КАК Пост
		|ГДЕ
		|	Пост.Сообщество = &Сообщество";
	
	Запрос.УстановитьПараметр("Сообщество", Сообщество);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КоличествоПостовСообщества 	= ВыборкаДетальныеЗаписи.Ссылка;
		КоличествоДней				= КоличествоПостовСообщества / ПостовВДень;
	Иначе 
		Возврат;
	КонецЕсли;
	
	Для Н = 0 По КоличествоДней Цикл
		
		ДатаПоста = ДатаПервогоПоста + Н * 60 * 60 * 24;
		
		Для Р = 1 По ПостовВДень Цикл
			МассивДат.Добавить(ДатаПоста + Расписание.Получить(Р));	
		КонецЦикла;
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТИПЗНАЧЕНИЯ(Пост.Содержание) КАК ТипПоста
		|ПОМЕСТИТЬ ТипыПостов
		|ИЗ
		|	Документ.Пост КАК Пост
		|ГДЕ
		|	Пост.Сообщество = &Сообщество
		|
		|СГРУППИРОВАТЬ ПО
		|	ТИПЗНАЧЕНИЯ(Пост.Содержание)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТипыПостов.ТипПоста КАК ТипПоста
		|ИЗ
		|	ТипыПостов КАК ТипыПостов";
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос.УстановитьПараметр("Сообщество", Сообщество);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	КонецЦикла;
	

КонецПроцедуры