#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Если Режим = РежимПроведенияДокумента.Оперативный Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДокументПост.Ссылка КАК Ссылка,
			|	ДокументПост.ПометкаУдаления КАК ПометкаУдаления,
			|	ДокументПост.Номер КАК Номер,
			|	ДокументПост.Дата КАК Дата,
			|	ДокументПост.Проведен КАК Проведен,
			|	ДокументПост.Содержание КАК Содержание,
			|	ДокументПост.Картинка КАК Картинка,
			|	ДокументПост.МоментВремени КАК МоментВремени,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ДокументПост.Содержание.Автор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
			|			ТОГДА ВЫБОР
			|					КОГДА ДокументПост.Содержание.ПроизведениеАвтор ССЫЛКА Справочник.Произведения
			|						ТОГДА ДокументПост.Содержание.ПроизведениеАвтор.Автор
			|					ИНАЧЕ ВЫБОР
			|							КОГДА ДокументПост.Содержание ССЫЛКА Справочник.Колонки
			|								ТОГДА ДокументПост.Содержание
			|							ИНАЧЕ ДокументПост.Содержание.ПроизведениеАвтор
			|						КОНЕЦ
			|				КОНЕЦ
			|		ИНАЧЕ ДокументПост.Содержание.Автор
			|	КОНЕЦ КАК Автор,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ДокументПост.Содержание.Автор, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
			|			ТОГДА ВЫБОР
			|					КОГДА ДокументПост.Содержание.ПроизведениеАвтор ССЫЛКА Справочник.Произведения
			|						ТОГДА ""Отрывок""
			|					ИНАЧЕ ВЫБОР
			|							КОГДА ДокументПост.Содержание ССЫЛКА Справочник.Колонки
			|								ТОГДА ""Колонка""
			|							ИНАЧЕ ""Цитата""
			|						КОНЕЦ
			|				КОНЕЦ
			|		ИНАЧЕ ""Произведение""
			|	КОНЕЦ КАК Вид
			|ИЗ
			|	Документ.Пост КАК ДокументПост
			|ГДЕ
			|	ДокументПост.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				
				Движение 				= РегистрыСведений.ПорядокПостов.СоздатьМенеджерЗаписи();
				Движение.Пост 			= ВыборкаДетальныеЗаписи.Ссылка;
				Движение.Опубликован 	= ЛОЖЬ;
				Движение.Дата 			= ВыборкаДетальныеЗаписи.Дата;
				Движение.Автор 			= ВыборкаДетальныеЗаписи.Автор;
				Движение.Вид			= ВыборкаДетальныеЗаписи.Вид;
				Движение.ДатаПубликации = Дата(1,1,1);
				Движение.Записать(Истина);
				
			КонецЕсли;
		КонецЕсли;
	КонецПроцедуры
	
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
#КонецОбласти
