
&НаСервере
Процедура ЗагрузитьНаСервере()
	
	НаборПрокси = СтрРазделить(СписокПрокси, Символы.ПС, Ложь);
	
	Для Каждого Прокси Из НаборПрокси Цикл
		
		ЧастиПрокси = СтрРазделить(Прокси, ":", Ложь);
		Адрес 		= ЧастиПрокси[0];
		Порт 		= ЧастиПрокси[1];
		
		Если Не ЗначениеЗаполнено(Справочники.Прокси.НайтиПоНаименованию(Адрес)) Тогда
		
			НовыйПрокси = Справочники.Прокси.СоздатьЭлемент();
			НовыйПрокси.ВремяПолучения 	= ТекущаяДатаСеанса();
			НовыйПрокси.Наименование 	= Адрес;
			НовыйПрокси.Порт 			= Порт;
			НовыйПрокси.Записать();
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сайт = "http://free-proxy.cz/ru/proxylist/country/all/https/ping/all";
КонецПроцедуры


