#Если Не ВебКлиент И Не ТонкийКлиент Тогда
	
#Область ПрограммныйИнтерфейс

Функция ОбработатьКартинкуПоШаблону(Знач ВидОбработки, Знач СтруктураОбработки, Знач ВозвращатьДД = Ложь) Экспорт
	
	НаименованиеВида = ВидОбработки.Наименование;
	
	ТекстА = СтруктураОбработки["ТекстА"];
	ТекстБ = СтруктураОбработки["ТекстБ"];
	//ТекстВ = СтруктураОбработки["ТекстВ"];
	
	Путь 	= ПолучитьИмяВременногоФайла("png");
	
	Если ТипЗнч(СтруктураОбработки["Медиа"]) = Тип("СправочникСсылка.Файлы") Тогда
		ОбъектМедиа = СтруктураОбработки["Медиа"].ПолучитьОбъект();
		ДД			= ОбъектМедиа.Файл.Получить();
	Иначе
		ДД		= СтруктураОбработки["МедиаДД"];
	КонецЕсли;
	
	ДД.Записать(Путь);
	
	Если НаименованиеВида = "Заголовок притчи" Тогда
		Метод_ЗаголовокПритчи(ТекстА, ТекстБ, Путь);
		
	ИначеЕсли НаименованиеВида = "Основной текст притчи" Тогда
		Метод_ОсновнойТекстПритчи(ТекстА, Путь);		
	КонецЕсли;
	
	Если ВозвращатьДД Тогда
		ДД 	= Новый ДвоичныеДанные(Путь);
		УдалитьФайлы(Путь);
		Возврат ДД;
	Иначе     
		Возврат Путь;
	КонецЕсли;
	
КонецФункции

Функция СформироватьГалерею(Знач Картинка) Экспорт
	
	Если ТипЗнч(Картинка) = Тип("ДвоичныеДанные") Тогда
		
		ВходнаяКартинка = ПолучитьИмяВременногоФайла("jpeg");
		Картинка.Записать(ВходнаяКартинка);
		Картинка = ВходнаяКартинка;
		
	КонецЕсли;
	
	МассивКартинок 		= Новый Массив;
	ОснованяКартинка 	= ПолучитьИмяВременногоФайла("jpg");
	ДопКартинка			= ПолучитьИмяВременногоФайла("jpg");
	ДопКартинка1 		= СтрЗаменить(ДопКартинка, ".jpg", "-0.jpg");
	ДопКартинка2 		= СтрЗаменить(ДопКартинка, ".jpg", "-1.jpg");
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	"convert -resize 768x1152 """ + Картинка + """ """ + ОснованяКартинка + """" + Символы.ПС + 
	"convert -gravity Center -crop ""91%"" """ + ОснованяКартинка + """ """ + ОснованяКартинка + """" + Символы.ПС +  
	"convert -crop 768x768 """ + ОснованяКартинка + """ """ + ДопКартинка + """" 
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	МассивКартинок.Добавить(Новый ДвоичныеДанные(ОснованяКартинка));
	МассивКартинок.Добавить(Новый ДвоичныеДанные(ДопКартинка1));
	МассивКартинок.Добавить(Новый ДвоичныеДанные(ДопКартинка2));
	
	УдалитьФайлы(ИмяСкрипта);
	УдалитьФайлы(ВходнаяКартинка);
	УдалитьФайлы(ОснованяКартинка);
	УдалитьФайлы(ДопКартинка);
	УдалитьФайлы(Картинка);
	
	Возврат МассивКартинок; 
	
КонецФункции

Функция СформироватьТермин(Знач Термин) Экспорт
	
	РазмерЗаголовка			= 84;
	РазмерШрифта         	= 30;
	ОграничениеПоСимволам 	= 64;
	
	ОбъектТермин			= Справочники.Файлы.Термин.ПолучитьОбъект();
	Фон						= ОбъектТермин.Файл.Получить();
	ПутьФон					= ПолучитьИмяВременногоФайла("png");
	КартинкаОбработанная	= ПолучитьИмяВременногоФайла("png");
	Фон.Записать(ПутьФон);
	
	Текст = СтрРазделить(Термин.Описание, " ", Ложь);
	ТекстСтрокой 	= "";
	ЧастьТекста		= "";
	Н 				= 0;
	
	Для Н = 0 По Текст.ВГраница() - 1 Цикл
		
		ТекстСтрокой = ТекстСтрокой + Текст[Н] + " ";
		ЧастьТекста  = ЧастьТекста 	+ Текст[Н] + " ";
		
		Если СтрДлина(ЧастьТекста + Текст[Н + 1]) > ОграничениеПоСимволам Тогда
			ТекстСтрокой = ТекстСтрокой + "\n";
			ЧастьТекста  = "";
		КонецЕсли;
		
	КонецЦикла;		
	
	ТекстСтрокой = ТекстСтрокой + Текст[Текст.ВГраница()];
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"magick " 
	+ ПутьФон 
	+ " -pointsize " 
	+ РазмерЗаголовка 
	+ " -fill white -font Sylfaen  -annotate +90+180 '" 
	+ Термин.Наименование 
	+"' "
	+ КартинкаОбработанная
	+ Символы.ПС
	+ "magick "
	+ КартинкаОбработанная
	+ " -pointsize "
	+ РазмерШрифта
	+" -fill white -font Tahoma -annotate +90+320 '"
	+ ТекстСтрокой
	+ "' "
	+ КартинкаОбработанная
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
	КартинкаДвоичные 	= Новый ДвоичныеДанные(КартинкаОбработанная);
	
	УдалитьФайлы(КартинкаОбработанная);
	УдалитьФайлы(ПутьФон);
	
	Возврат КартинкаДвоичные;
	
КонецФункции

Функция СформироватьСобытие(Знач Событие, Знач Сообщество) Экспорт
		
	ЦветПодложки 	= "black";
	ЦветТекста 		= "white";
	Шрифт			= "Sylfaen";
	
	КартинкаОбработанная = ПолучитьИмяВременногоФайла(".png");

	Место			= Событие.Место;
	Наименование 	= Событие.Аннотация;
	ДатаСобытия		= Событие.Дата;
	
	ЛогоДД 	= Сообщество.ПолучитьОбъект().Лого.Получить();
	Лого	= ПолучитьИмяВременногоФайла(".png");
	ЛогоДД.Записать(Лого);

	ФотоДД 	= Событие.ПолучитьОбъект().КартинкаДД.Получить();
	Фото	= ПолучитьИмяВременногоФайла(".png");
	ФотоДД.Записать(Фото);
	
	//Переносы = СтрРазделить(Событие.Аннотация, "\n").ВГраница();

	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"convert -resize 96x96 """
	+ Лого
	+ """ """ 
	+ Лого
	+ """"
	+ Символы.ПС
	+ "magick """
	+ Фото
	+ """ """ 
	+ Лого
	+ """ -gravity SouthWest -geometry +15+"
	+ Строка(Событие.ОтступМарки)
	+ " -composite """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -fill white -stroke " + ЦветТекста + " -undercolor " + ЦветПодложки + " -font " + Шрифт + " -pointsize 28 -gravity SouthWest -draw ""text 130,65 '"
	+ Наименование 
	+ "'"" """ 
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -fill white -stroke " + ЦветТекста + " -undercolor " + ЦветПодложки + " -font Tahoma -pointsize 18 -gravity SouthWest -draw ""text 130,30 '"
	+ Место
	+ ", "
	+ ДатаСобытия
	+ "'"" """
	+ КартинкаОбработанная
	+ """"
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);

	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта, ,Истина, КодВозврата);
	
	
	
	КартинкаДвоичные 	= Новый ДвоичныеДанные(КартинкаОбработанная);
	
	УдалитьФайлы(ИмяСкрипта);
	УдалитьФайлы(КартинкаОбработанная);
	УдалитьФайлы(Лого);
	УдалитьФайлы(Фото);

	
	Возврат КартинкаДвоичные;

КонецФункции


Функция СформироватьИзображениеСТекстом(Знач Содержание, Знач Текст, Знач Автор, Знач Картинка, Знач История = Ложь) Экспорт
	
	Если ТипЗнч(Содержание) = Тип("СправочникСсылка.Цитаты") Тогда
		
		РазмерШрифта         	= ?(История, 28, 39); 
		ОграничениеПоСимволам 	= ?(История, 31, 45);
		
		МассивФорматов = Новый Массив;
		МассивФорматов.Добавить(".jpeg");
		МассивФорматов.Добавить(".png");
		МассивФорматов.Добавить(".jpg");
		МассивФорматов.Добавить(".webm");
		МассивФорматов.Добавить(".gif");
		МассивФорматов.Добавить(".svc");
		
		Если ТипЗнч(Картинка) = Тип("Строка") Тогда
			КартинкаОбработанная = Картинка;
		Иначе
			//@skip-check missing-temporary-file-deletion
			КартинкаОбработанная = ПолучитьИмяВременногоФайла("png");
			Картинка.Записать(КартинкаОбработанная);
		КонецЕсли;
		
		
		Текст = СтрРазделить(Текст, " ", Ложь);
		ТекстСтрокой 	= "";
		ЧастьТекста		= "";
		Н 				= 0;
		
		Для Н = 0 По Текст.ВГраница() - 1 Цикл
			
			ТекстСтрокой = ТекстСтрокой + Текст[Н] + " ";
			ЧастьТекста  = ЧастьТекста 	+ Текст[Н] + " ";
			
			Если СтрДлина(ЧастьТекста + Текст[Н + 1]) > ОграничениеПоСимволам Тогда
				ТекстСтрокой = ТекстСтрокой + "\n";
				ЧастьТекста  = "";
			КонецЕсли;
			
		КонецЦикла;		
		
		ТекстСтрокой = ТекстСтрокой + Текст[Текст.ВГраница()];
		ТекстСтрокой = ТекстСтрокой + "\n" + "\n" + Автор;
		ТекстСтрокой = СтрЗаменить(ТекстСтрокой, """", "\""");
		
		
		ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
		ТекстСкрипта			= Новый ТекстовыйДокумент();
		ТекстСкрипта.УстановитьТекст(
		"magick """ 
		+ КартинкаОбработанная  
		+""" -background ""#000000C3"" -fill ""#FFFFFFFF"" -font Sylfaen -size 1024x1024 -gravity Center -size 1024x1024 -pointsize " + РазмерШрифта + " label:'"
		+ ТекстСтрокой
		+"' -gravity Center -composite """
		+ КартинкаОбработанная
		+ """");
		
		ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
		
		КодВозврата = 0;
		ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
		
		УдалитьФайлы(ИмяСкрипта);
		
	Иначе
		
		КартинкаОбработанная = Ложь;
		
	КонецЕсли;
	
	
	Возврат КартинкаОбработанная;
	
КонецФункции

Функция СформироватьРекламуКниги(Знач Книга) Экспорт
	
	//@skip-check reading-attribute-from-database
	ФонДД 	= Справочники.Файлы.РК_Фон.Файл.Получить();
	Фон		= ПолучитьИмяВременногоФайла(".png");
	ФонДД.Записать(Фон);
	
	//@skip-check reading-attribute-from-database
	РамкаДД = Справочники.Файлы.РК_Рамка.Файл.Получить();
	Рамка	= ПолучитьИмяВременногоФайла(".png");
	РамкаДД.Записать(Рамка);
	
	ОбъектКнига = Книга.ПолучитьОбъект();
	
	КартинкаКнигиДД = ОбъектКнига.КартинкаДвоичные.Получить();
	КартинкаКниги 	= ПолучитьИмяВременногоФайла(".png");
	КартинкаКнигиДД.Записать(КартинкаКниги);
	
	КодКниги 		= ОбъектКнига.Код;
	НазваниеКниги 	= ОбъектКнига.Наименование;
	АвторКниги 		= ОбъектКнига.Автор.Имя + " " + ОбъектКнига.Автор.Фамилия;
	
	//@skip-check missing-temporary-file-deletion
	КартинкаОбработанная = ПолучитьИмяВременногоФайла(".png");
	
	МассивВФ = Новый Массив;
	МассивВФ.Добавить(Фон);
	МассивВФ.Добавить(Рамка);
	МассивВФ.Добавить(КартинкаКниги);
	
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"convert -resize 365x528! """
	+ КартинкаКниги
	+ """ """
	+ КартинкаКниги
	+ """"
	+ Символы.ПС
	+ "magick """
	+ Фон
	+ """ """
	+ КартинкаКниги
	+ """ -geometry +120+500 -composite """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ """
	+ Рамка
	+ """ -geometry +120+500 -composite """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 32 -fill white -font Sylfaen -gravity South -annotate -210+120 '"
	+ НазваниеКниги
	+ "' """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 22 -fill grey -font Tahoma -gravity South -annotate -210+90 '"
	+ АвторКниги
	+ "' """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 88 -fill white -font Sylfaen -gravity Center -annotate +0-290 '"
	+ НазваниеКниги
	+ "' """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 24 -fill grey -font Tahoma -gravity Center -annotate +0-220 '"
	+ АвторКниги
	+ " в библиотеке Two-Digit Athenaeum'"""
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 66 -fill grey -font Sylfaen -gravity South -annotate +160+330 'по коду:' """
	+ КартинкаОбработанная 
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 120 -fill white -font Tahoma -gravity South -annotate +200+195 '"
	+ КодКниги
	+ "' """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "convert -resize 768x768 """
	+ КартинкаОбработанная
	+ """ """
	+ КартинкаОбработанная
	+ """"

	
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);

	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта, ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	УдалитьФайлы(Фон);
	УдалитьФайлы(Рамка);
	УдалитьФайлы(КартинкаКниги);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Картинка", КартинкаОбработанная);
	СтруктураВозврата.Вставить("МассивВФ", МассивВФ);
	
	Возврат СтруктураВозврата
	
КонецФункции

Функция СформироватьКартинкуДняРождения(Знач Человек) Экспорт
	
	ОбъектАвтор = Человек.ПолучитьОбъект();
	ДД 			= ОбъектАвтор.Фото.Получить();
	
	//@skip-check missing-temporary-file-deletion
	Путь		= ПолучитьИмяВременногоФайла("jpg");
	
	ОбъектДР	= Справочники.Файлы.ДР.ПолучитьОбъект();
	Маска		= ОбъектДР.Файл.Получить();
	ПутьМаска	= ПолучитьИмяВременногоФайла("png");
	
	ДД.Записать(Путь);
	Маска.Записать(ПутьМаска);
	
	Если ОбъектАвтор.ОсновноеСообщество = Справочники.Сообщества.Athenaeum
		Или ОбъектАвтор.ОсновноеСообщество = Справочники.Сообщества.Тест Тогда
		
		ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
		ТекстСкрипта			= Новый ТекстовыйДокумент();
		
		ТекстСкрипта.УстановитьТекст(
		"convert -resize 1143x643 """ 
		+ Путь + """ """ 
		+ Путь 
		+ """" 
		+ Символы.ПС 
		+ "magick """ 
		+ Путь 
		+ """ """ 
		+ ПутьМаска 
		+ """" 
		+ " -grayscale Rec709Luminance  -geometry 1143x643 -gravity Center -composite """ 
		+ Путь
		+ """" 
		+ Символы.ПС 
		+"magick """ 
		+ Путь 
		+ """ -pointsize 50 -fill white -font Sylfaen -gravity Center -annotate +0+70 '" 
		+ ОбъектАвтор.Имя 
		+ " " 
		+ ОбъектАвтор.Фамилия 
		+ "' """ 
		+ Путь + """" 
		+ Символы.ПС 
		+ "magick """ 
		+ Путь 
		+ """ -pointsize 24 -fill white -font Tahoma -gravity Center -annotate +0+117 '" 
		+ Формат(ОбъектАвтор.ДР, "ДЛФ=DD") 
		+ "' """ 
		+ Путь 
		+ """"		
		);
		
		ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
		
		КодВозврата = 0;
		ЗапуститьПриложение("powershell -file " + ИмяСкрипта, ,Истина, КодВозврата);
		УдалитьФайлы(ИмяСкрипта);
		УдалитьФайлы(ПутьМаска);
		
	КонецЕсли;

	Возврат Путь;
	
КонецФункции

Процедура СоздатьКарточки(Знач ПутьКОригиналу) Экспорт
	
	Картинка 		= Новый Файл(ПутьКОригиналу);
	Путь			= Картинка.Путь;
	Размеры 		= Новый Соответствие;
	
	Размеры.Вставить("small"	, "175x270");
	Размеры.Вставить("medium"	, "295x455");
	
	Для Каждого Размер Из Размеры Цикл
		
		РазмерМассив = СтрРазделить(Размер.Значение, "x");
		Ширина 	= РазмерМассив[0];
		//Высота	= РазмерМассив[1];
		
		ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
		ТекстСкрипта			= Новый ТекстовыйДокумент();
		ТекстСкрипта.УстановитьТекст(
		"magick convert -resize " + Ширина + "x -unsharp 0x0.55+0.55+0.008 -quality 90 "
		+ ПутьКОригиналу 
		+ " "
		+ Путь 
		+ Размер.Ключ 
		+ ".webp"
		
		+ Символы.ПС +
		
		"convert "
		+ Путь 
		+ Размер.Ключ
		+ ".webp"
		+ " -resize " + Размер.Значение + "! -gravity North -extent " + Размер.Значение + " "
		+ Путь 
		+ Размер.Ключ
		+ ".webp"
		);
		
		ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);				
		КодВозврата = 0;
		ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
		
		УдалитьФайлы(ИмяСкрипта);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти




#Область СлужебныеПроцедурыИФункции

Процедура Метод_ЗаголовокПритчи(Знач ТекстА, Знач ТекстБ, Знач Путь) 
	
	
	РазмерЗаголовка			= 74;
	РазмерШрифта         	= 35;
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"magick " 
	+ Путь 
	+ " -pointsize " 
	+ РазмерЗаголовка 
	+ " -gravity Center -fill white -font Sylfaen  -annotate +0+50 '" 
	+ ТекстА 
	+"' "
	+ Путь
	+ Символы.ПС
	+"magick "
	+ Путь
	+ " -pointsize "
	+ РазмерШрифта
	+" -gravity Center -fill gray -font Tahoma -annotate +0+250 '"
	+ ТекстБ
	+ "' "
	+ Путь
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
КонецПроцедуры

Процедура Метод_ОсновнойТекстПритчи(Знач ТекстА, Знач Путь);

	//РазмерЗаголовка			= 84;
	РазмерШрифта         	= 30;
	ОграничениеПоСимволам 	= 54;
	
	Текст = СтрЗаменить(ТекстА, "¶", " \n ");
	Текст = СтрЗаменить(Текст, Символы.ПС, " \n ");
	Текст = СтрРазделить(Текст, " ", Ложь);
	ТекстСтрокой 	= "";
	ЧастьТекста		= "";
	Н 				= 0;
	
	Для Н = 0 По Текст.ВГраница() - 1 Цикл
		
		Если Текст[Н] = "\n" Тогда
			ТекстСтрокой = ТекстСтрокой + Текст[Н];
			ЧастьТекста = "";
			Продолжить;
		КонецЕсли;
		
		ТекстСтрокой = ТекстСтрокой + Текст[Н] + " ";
		ЧастьТекста  = ЧастьТекста 	+ Текст[Н] + " ";
		
		Если СтрДлина(ЧастьТекста + Текст[Н + 1]) > ОграничениеПоСимволам Тогда
			ТекстСтрокой = ТекстСтрокой + "\n";
			ЧастьТекста  = "";
		КонецЕсли;
		
	КонецЦикла;		
	
	ТекстСтрокой = ТекстСтрокой + Текст[Текст.ВГраница()];
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"magick "
	+ Путь
	+ " -pointsize "
	+ РазмерШрифта
	+" -gravity Center -fill white -font Tahoma -annotate +0+0 '"
	+ ТекстСтрокой
	+ "' "
	+ Путь
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
