#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьТест(Запрос, Ответ) Экспорт
	
	Попытка
		
		Если Не Константы.ЗаписыватьТесты.Получить() Тогда
			Возврат;
		КонецЕсли;
		
		НовыйТест = Справочники.АвтотестыСервисов.СоздатьЭлемент();
		НовыйТест.Наименование 	= "Тест " + Строка(Новый УникальныйИдентификатор);
		НовыйТест.ВходнойJSON	= МетодыРаботыHttp.JSONСтрокой(Запрос.ПолучитьТелоКакСтроку());
			
	Исключение
		ИнструментарийВызовСервера.ЗаписьВЖурналИсключений(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти