Функция СформироватьИзображениеСТекстом(Знач Содержание, Знач Текст, Знач Автор, Знач Картинка, Знач История = Ложь) Экспорт
	
	Если ТипЗнч(Содержание) = Тип("СправочникСсылка.Цитаты") Тогда
		
		РазмерШрифта         	= ?(История, 28, 39); 
		ОграничениеПоСимволам 	= ?(История, 31, 45);
		
		МассивФорматов = Новый Массив;
		МассивФорматов.Добавить(".jpeg");
		МассивФорматов.Добавить(".png");
		МассивФорматов.Добавить(".jpg");
		МассивФорматов.Добавить(".webm");
		МассивФорматов.Добавить(".gif");
		МассивФорматов.Добавить(".svc");
		
		КартинкаОбработанная		= Картинка;
		
		
		
		Текст = СтрРазделить(Текст, " ", Ложь);
		ТекстСтрокой 	= "";
		ЧастьТекста		= "";
		Н 				= 0;
		
		Для Н = 0 По Текст.ВГраница() - 1 Цикл
			
			ТекстСтрокой = ТекстСтрокой + Текст[Н] + " ";
			ЧастьТекста  = ЧастьТекста 	+ Текст[Н] + " ";
			
			Если СтрДлина(ЧастьТекста + Текст[Н + 1]) > ОграничениеПоСимволам Тогда
				ТекстСтрокой = ТекстСтрокой + "\n";
				ЧастьТекста  = "";
			КонецЕсли;
			
		КонецЦикла;		
		
		ТекстСтрокой = ТекстСтрокой + Текст[Текст.ВГраница()];
		ТекстСтрокой = ТекстСтрокой + "\n" + "\n" + Автор;
		
		
		ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
		ТекстСкрипта			= Новый ТекстовыйДокумент();
		ТекстСкрипта.УстановитьТекст(
		"magick """ 
		+ Картинка  
		+""" -background ""#000000C3"" -fill ""#FFFFFFFF"" -font Sylfaen -size 1024x1024 -gravity Center -size 1024x1024 -pointsize " + РазмерШрифта + " label:'"
		+ ТекстСтрокой
		+"' -gravity Center -composite """
		+ КартинкаОбработанная
		+ """");
		
		ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
		
		
		КодВозврата = 0;
		ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
		Сообщение = Новый Соответствие;
		Сообщение.Вставить("Картинка", КартинкаОбработанная);
		
		УдалитьФайлы(ИмяСкрипта);
		
	Иначе
		
		КартинкаОбработанная = Ложь;
		
	КонецЕсли;
	
	
	Возврат КартинкаОбработанная;
	
КонецФункции

Процедура СоздатьКарточки(Знач ПутьКОригиналу) Экспорт
	
	Картинка 		= Новый Файл(ПутьКОригиналу);
	Путь			= Картинка.Путь;
	Размеры 		= Новый Соответствие;
	
	Размеры.Вставить("small"	, "175x270");
	Размеры.Вставить("medium"	, "295x455");
	
	Для Каждого Размер Из Размеры Цикл
		
		РазмерМассив = СтрРазделить(Размер.Значение, "x");
		Ширина 	= РазмерМассив[0];
		Высота	= РазмерМассив[1];
		
		ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
		ТекстСкрипта			= Новый ТекстовыйДокумент();
		ТекстСкрипта.УстановитьТекст(
		"magick convert -resize " + Ширина + "x -unsharp 0x0.55+0.55+0.008 -quality 90 "
		+ ПутьКОригиналу 
		+ " "
		+ Путь 
		+ Размер.Ключ 
		+ ".webp"
		
		+ Символы.ПС +
		
		"convert "
		+ Путь 
		+ Размер.Ключ
		+ ".webp"
		+ " -resize " + Размер.Значение + "! -gravity North -extent " + Размер.Значение + " "
		+ Путь 
		+ Размер.Ключ
		+ ".webp"
		);
		
		ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);				
		КодВозврата = 0;
		ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
		
		УдалитьФайлы(ИмяСкрипта);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьГалерею(Знач Картинка) Экспорт
	
	МассивКартинок 		= Новый Массив;
	ОснованяКартинка 	= ПолучитьИмяВременногоФайла("jpg");
	ДопКартинка			= ПолучитьИмяВременногоФайла("jpg");
	ДопКартинка1 		= СтрЗаменить(ДопКартинка, ".jpg", "-0.jpg");
	ДопКартинка2 		= СтрЗаменить(ДопКартинка, ".jpg", "-1.jpg");
	
	МассивКартинок.Добавить(ОснованяКартинка);
	МассивКартинок.Добавить(ДопКартинка1);
	МассивКартинок.Добавить(ДопКартинка2);
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	"convert -resize 768x1152 """ + Картинка + """ """ + ОснованяКартинка + """" + Символы.ПС + 
	"convert -gravity Center -crop ""91%"" """ + ОснованяКартинка + """ """ + ОснованяКартинка + """" + Символы.ПС +  
	"convert -crop 768x768 """ + ОснованяКартинка + """ """ + ДопКартинка + """" 
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	Возврат МассивКартинок; 
	
КонецФункции

Функция СформироватьТермин(Знач Термин, Знач ВернутьДД = Ложь) Экспорт
	
	РазмерЗаголовка			= 84;
	РазмерШрифта         	= 30;
	ОграничениеПоСимволам 	= 64;
	
	ОбъектТермин			= Справочники.Файлы.Термин.ПолучитьОбъект();
	Фон						= ОбъектТермин.Файл.Получить();
	ПутьФон					= ПолучитьИмяВременногоФайла("png");
	КартинкаОбработанная	= ПолучитьИмяВременногоФайла("png");
	Фон.Записать(ПутьФон);
	
	Текст = СтрРазделить(Термин.Описание, " ", Ложь);
	ТекстСтрокой 	= "";
	ЧастьТекста		= "";
	Н 				= 0;
	
	Для Н = 0 По Текст.ВГраница() - 1 Цикл
		
		ТекстСтрокой = ТекстСтрокой + Текст[Н] + " ";
		ЧастьТекста  = ЧастьТекста 	+ Текст[Н] + " ";
		
		Если СтрДлина(ЧастьТекста + Текст[Н + 1]) > ОграничениеПоСимволам Тогда
			ТекстСтрокой = ТекстСтрокой + "\n";
			ЧастьТекста  = "";
		КонецЕсли;
		
	КонецЦикла;		
	
	ТекстСтрокой = ТекстСтрокой + Текст[Текст.ВГраница()];
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"magick " 
	+ ПутьФон 
	+ " -pointsize " 
	+ РазмерЗаголовка 
	+ " -fill white -font Sylfaen  -annotate +90+180 '" 
	+ Термин.Наименование 
	+"' "
	+ КартинкаОбработанная
	+ Символы.ПС
	+ "magick "
	+ КартинкаОбработанная
	+ " -pointsize "
	+ РазмерШрифта
	+" -fill white -font Tahoma -annotate +90+320 '"
	+ ТекстСтрокой
	+ "' "
	+ КартинкаОбработанная
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
	Если ВернутьДД Тогда
		Путь 					= КартинкаОбработанная;
		КартинкаОбработанная 	= Новый ДвоичныеДанные(Путь);
		УдалитьФайлы(Путь);
	КонецЕсли;
	
	Возврат КартинкаОбработанная;
	
КонецФункции

Функция СформироватьРекламуКниги(Знач Книга) Экспорт
	
	ФонДД 	= Справочники.Файлы.РК_Фон.Файл.Получить();
	Фон		= ПолучитьИмяВременногоФайла(".png");
	ФонДД.Записать(Фон);
	
	РамкаДД = Справочники.Файлы.РК_Рамка.Файл.Получить();
	Рамка	= ПолучитьИмяВременногоФайла(".png");
	РамкаДД.Записать(Рамка);
	
	ОбъектКнига = Книга.ПолучитьОбъект();
	
	КартинкаКнигиДД = ОбъектКнига.КартинкаДвоичные.Получить();
	КартинкаКниги 	= ПолучитьИмяВременногоФайла(".png");
	КартинкаКнигиДД.Записать(КартинкаКниги);
	
	КодКниги 		= ОбъектКнига.Код;
	НазваниеКниги 	= ОбъектКнига.Наименование;
	АвторКниги 		= ОбъектКнига.Автор.Имя + " " + ОбъектКнига.Автор.Фамилия;
	
	КартинкаОбработанная = ПолучитьИмяВременногоФайла(".png");
	
	МассивВФ = Новый Массив;
	МассивВФ.Добавить(Фон);
	МассивВФ.Добавить(Рамка);
	МассивВФ.Добавить(КартинкаКниги);
	
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"convert -resize 365x528! """
	+ КартинкаКниги
	+ """ """
	+ КартинкаКниги
	+ """"
	+ Символы.ПС
	+ "magick """
	+ Фон
	+ """ """
	+ КартинкаКниги
	+ """ -geometry +120+500 -composite """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ """
	+ Рамка
	+ """ -geometry +120+500 -composite """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 32 -fill white -font Sylfaen -gravity South -annotate -210+120 '"
	+ НазваниеКниги
	+ "' """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 22 -fill grey -font Tahoma -gravity South -annotate -210+90 '"
	+ АвторКниги
	+ "' """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 88 -fill white -font Sylfaen -gravity Center -annotate +0-290 '"
	+ НазваниеКниги
	+ "' """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 24 -fill grey -font Tahoma -gravity Center -annotate +0-220 '"
	+ АвторКниги
	+ " в библиотеке Two-Digit Athenaeum'"""
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 66 -fill grey -font Sylfaen -gravity South -annotate +160+330 'по коду:' """
	+ КартинкаОбработанная 
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -pointsize 120 -fill white -font Tahoma -gravity South -annotate +200+195 '"
	+ КодКниги
	+ "' """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "convert -resize 768x768 """
	+ КартинкаОбработанная
	+ """ """
	+ КартинкаОбработанная
	+ """"

	
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);

	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта, ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Картинка", КартинкаОбработанная);
	СтруктураВозврата.Вставить("МассивВФ", МассивВФ);
	
	Возврат СтруктураВозврата
	
КонецФункции

Функция СформироватьСобытие(Знач Событие, Знач Сообщество, Знач ВернутьДД = Ложь) Экспорт
	
	Если Сообщество = Справочники.Сообщества.ПиБ Тогда
		
		ЦветПодложки 	= """#510000""";
		ЦветТекста 		= "white";
		Шрифт			= "Inkulinati-210706-Regular";		
		
	Иначе
		
		ЦветПодложки 	= "black";
		ЦветТекста 		= "white";
		Шрифт			= "Sylfaen";
	КонецЕсли;
	
	
	КартинкаОбработанная = ПолучитьИмяВременногоФайла(".png");

	Место			= Событие.Место;
	Наименование 	= Событие.Аннотация;
	ДатаСобытия		= Событие.Дата;
	
	ЛогоДД 	= Сообщество.ПолучитьОбъект().Лого.Получить();
	Лого	= ПолучитьИмяВременногоФайла(".png");
	ЛогоДД.Записать(Лого);

	ФотоДД 	= Событие.ПолучитьОбъект().КартинкаДД.Получить();
	Фото	= ПолучитьИмяВременногоФайла(".png");
	ФотоДД.Записать(Фото);
	
	Переносы = СтрРазделить(Событие.Аннотация, "\n").ВГраница();

	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"convert -resize 96x96 """
	+ Лого
	+ """ """ 
	+ Лого
	+ """"
	+ Символы.ПС
	+ "magick """
	+ Фото
	+ """ """ 
	+ Лого
	+ """ -gravity SouthWest -geometry +15+"
	+ Строка(Событие.ОтступМарки)
	+ " -composite """
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -fill white -stroke " + ЦветТекста + " -undercolor " + ЦветПодложки + " -font " + Шрифт + " -pointsize 28 -gravity SouthWest -draw ""text 130,65 '"
	+ Наименование 
	+ "'"" """ 
	+ КартинкаОбработанная
	+ """"
	+ Символы.ПС
	+ "magick """
	+ КартинкаОбработанная
	+ """ -fill white -stroke " + ЦветТекста + " -undercolor " + ЦветПодложки + " -font Tahoma -pointsize 18 -gravity SouthWest -draw ""text 130,30 '"
	+ Место
	+ ", "
	+ ДатаСобытия
	+ "'"" """
	+ КартинкаОбработанная
	+ """"
	
	
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);

	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта, ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);

	Если ВернутьДД Тогда
		Путь 					= КартинкаОбработанная;
		КартинкаОбработанная 	= Новый ДвоичныеДанные(Путь);
		УдалитьФайлы(Путь);
	КонецЕсли;
	
	Возврат КартинкаОбработанная;

КонецФункции

Функция ПолучитьТаблицуПрокси() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Прокси.Наименование КАК Адрес,
	|	Прокси.Порт КАК Порт,
	|	Прокси.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Прокси КАК Прокси
	|ГДЕ
	|	Прокси.ВремяСмерти = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуАгентов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	UserAgents.Агент КАК Агент
	|ИЗ
	|	Справочник.UserAgents КАК UserAgents";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПроверитьПрокси(Адрес, Порт) Экспорт
	
	Прокси = Новый ИнтернетПрокси;
	Прокси.Установить("https", Адрес, Число(Порт));
	
	Попытка 
		Соединение = Новый HTTPСоединение("https://api.vk.com/",443 , , , Прокси, 100, Новый ЗащищенноеСоединениеOpenSSL());
		Возврат Истина;
	Исключение 
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции