#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьКартинку();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОсьXПриИзменении(Элемент)
    ОбновитьКартинку();
КонецПроцедуры

&НаКлиенте
Процедура ОсьYПриИзменении(Элемент)
    ОбновитьКартинку();
КонецПроцедуры

&НаКлиенте
Процедура ДопОтступПриИзменении(Элемент)
    ОбновитьКартинку();
КонецПроцедуры

&НаКлиенте
Процедура РасположениеМаркиПриИзменении(Элемент)
    ОбновитьКартинку();
КонецПроцедуры

&НаКлиенте
Процедура ПутьОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнструментарийКлиент.ЗаписатьФайлВРеквизит(Объект.Ссылка, ЭтотОбъект, "Картинка", "Путь");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьКартинку()
	
	Записать();
	ПутьККартинке = ПоместитьВоВременноеХранилище(МетодыОбработкиИзображений.СформироватьБиографию(Объект.Ссылка)
		, Новый УникальныйИдентификатор);
		
КонецПроцедуры

#КонецОбласти