#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьКартинку();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОсьXПриИзменении(Элемент)
    ОбновитьКартинку();
КонецПроцедуры

&НаКлиенте
Процедура ОсьYПриИзменении(Элемент)
    ОбновитьКартинку();
КонецПроцедуры

&НаКлиенте
Процедура ДопОтступПриИзменении(Элемент)
    ОбновитьКартинку();
КонецПроцедуры

&НаКлиенте
Процедура РасположениеМаркиПриИзменении(Элемент)
    ОбновитьКартинку();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	Диалог 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок 		= "Выберите файл";
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		Объект.Путь = ВыбранныеФайлы[0];
		ЗаписатьДвоичныеДанныеКартинки(Новый ДвоичныеДанные(Объект.Путь));
				
		Закрыть();
	  	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвоичныеДанныеКартинки(ДД)
	
	Записать();
	ОбъектБио 		      = Объект.Ссылка.ПолучитьОбъект();
	ОбъектБио["Картинка"] = Новый ХранилищеЗначения(ДД);
	ОбъектБио.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинку()
	
	Записать();
	ПутьККартинке = ПоместитьВоВременноеХранилище(МетодыОбработкиИзображений.СформироватьБиографию(Объект.Ссылка)
		, Новый УникальныйИдентификатор);
		
КонецПроцедуры

#КонецОбласти