
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ПроизведениеАвтор) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Цитаты.ПроизведениеАвтор КАК ПроизведениеАвтор
		|ИЗ
		|	Справочник.Цитаты КАК Цитаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Цитаты.Код УБЫВ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Объект.ПроизведениеАвтор = ВыборкаДетальныеЗаписи.ПроизведениеАвтор;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
