#Область ОбработчикиСобытий

Функция returnStatusget(Запрос)
	
	Источник 	= Запрос.Заголовки.Получить("Athenaeum-Source");
	IP			= Запрос.Заголовки.Получить("X-Forwarded-For");
	
	МЗ = РегистрыСведений.ОтслеживаниеПосещений.СоздатьМенеджерЗаписи();
	МЗ.UID	 	= Строка(Новый УникальныйИдентификатор);
	МЗ.Период 	= ТекущаяДатаСеанса();
	МЗ.Страница	= Строка(Источник);
	МЗ.IP		= Строка(IP);
	МЗ.Записать();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция returnStatuscors(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

#КонецОбласти