#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КартинкаЛого = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Лого");
КонецПроцедуры

#КонецОбласти




#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Авторизовать(Команда)
	АвторизоватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКомпанию(Команда)
	Объект.ВК_НомерКомпании = СоздатьКомпаниюНаСервере(Объект.Ссылка);
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПутьОткрытие(Команда)
	

	Диалог 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок 		= "Выбирите файл";
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);

КонецПроцедуры

#КонецОбласти




#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АвторизоватьНаСервере()
	
	СсылкаАвторизации = МетодыРаботыVK.СоздатьСсылкуПолученияТокена(Объект.ВК_client_id);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьКомпаниюНаСервере(Сообщество)
	
	РеквизитыСообщества = ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Сообщество, "ВК_Кабинет,Наименование");
	IDКабинета 			= РеквизитыСообщества.ВК_Кабинет.ID;
	Возврат МетодыРаботыVK.СоздатьРекламнуюКампанию(Сообщество, IDКабинета, "AIO-" + РеквизитыСообщества.Наименование)["response"][0]["id"];

КонецФункции

&НаСервере
Процедура ЗаписатьДвоичныеДанныеФайла(ДД)
	
	Записать();
	ОбъектПост 				= Объект.Ссылка.ПолучитьОбъект();
	ОбъектПост.Лого 	= Новый ХранилищеЗначения(ДД);
	ОбъектПост.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда	
		Путь = ВыбранныеФайлы[0];
		ЗаписатьДвоичныеДанныеФайла(Новый ДвоичныеДанные(Путь));	
		
		Закрыть();
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
