#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Попытка
		Данные = Элементы.Список.ТекущиеДанные.Данные;
		Данные = РаскодироватьДанные(Данные);	
	Исключение
		Данные = Неопределено;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьЛог(Команда)
	ОчиститьЛогНаСервере();
	Элементы.Список.Обновить();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОчиститьЛогНаСервере()
	НЗ = РегистрыСведений.Логирование.СоздатьНаборЗаписей();
	НЗ.Записать(Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РаскодироватьДанные(Данные)
	Возврат ИнструментарийВызовСервера.UnicodeEscape(Данные);	
КонецФункции

#КонецОбласти
