#Область СлужебныйПрограммныйИнтерфейс

Функция sendPhoto(Параметры) Экспорт
	
	Параметры.Вставить("protect_content", "true");
	
	Файлы = Новый Массив;
	Счетчик = 0;
	
	Для каждого Фото Из Параметры.photo Цикл
		
		ИВФ = ПолучитьИмяВременногоФайла("jpeg");
		//@skip-check object-deprecated
		КопироватьФайл(Фото, ИВФ);
		Картинка = Новый ДвоичныеДанные(ИВФ);
	
		Файлы.Добавить(Новый Структура(Строка("Имя,Данные,ИмяФайла,Тип")
				, "photo"
				, Картинка
				, "photo" + Строка(Счетчик) + ".jpeg"
				, "image/jpeg"));
		Счетчик = Счетчик + 1;
		УдалитьФайлы(ИВФ);

	КонецЦикла; 
	
	Параметры.Удалить("photo");
	
	Ответ = КоннекторHTTP.КакJson(КоннекторHTTP.Post("https://api.telegram.org/bot" + Параметры.token + "/sendPhoto", Параметры, Новый Структура("Файлы", Файлы)));

	Возврат Ответ;
	
КонецФункции

Функция sendMediaGroup(Параметры) Экспорт
	
	Параметры.Вставить("protect_content", "true");
	
	Файлы = Новый Массив;
	Медиа = Новый Массив;
	
	Счетчик = 0;
	Первый		= Истина;

	
	Для каждого Фото Из Параметры.photo Цикл
		
		ИВФ = ПолучитьИмяВременногоФайла("jpeg");
		//@skip-check object-deprecated
		
		ФайлПути 	= Новый Файл(Фото);
				
		Если ФайлПути.Существует() Тогда
			КопироватьФайл(Фото, ИВФ);
			Картинка = Новый ДвоичныеДанные(ИВФ);
			
			Файлы.Добавить(Новый Структура(Строка("Имя,Данные,ИмяФайла,Тип")
			, "photo" + Строка(Счетчик)
			, Картинка
			, "photo" + Строка(Счетчик) + ".jpeg"
			, "image/jpeg"));
			
			СтруктураМедиа = Новый Структура;
			СтруктураМедиа.Вставить("type", "photo");
			СтруктураМедиа.Вставить("media", "attach://" + "photo" + Строка(Счетчик));
			
			Если Первый Тогда
				СтруктураМедиа.Вставить("caption", Параметры.caption);
				Первый = Ложь;
			КонецЕсли;
			
			Медиа.Добавить(СтруктураМедиа);
			
			Счетчик = Счетчик + 1;
			УдалитьФайлы(ИВФ);
		КонецЕсли;

	КонецЦикла; 
	
	Параметры.Удалить("photo");
	Параметры.Вставить("media", ИнструментарийВызовСервера.JSONСтрокой(Медиа));
	
	Ответ = КоннекторHTTP.КакJson(КоннекторHTTP.Post("https://api.telegram.org/bot" + Параметры.token + "/sendMediaGroup", Параметры, Новый Структура("Файлы", Файлы)));

	Возврат Ответ;

КонецФункции
#КонецОбласти
