#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере()
	
	НачалоГода 		= Дата(Год(ТекущаяДатаСеанса()), 1, 1, 0, 0, 0);
	ОкончаниеГода	= КонецГода(НачалоГода);
	НЗ				= РегистрыСведений.Календарь.СоздатьНаборЗаписей();
	
	
	Пока НачалоГода <= ОкончаниеГода Цикл
		НоваяДата	 	= НЗ.Добавить();
		НоваяДата.Дата 	= НачалоГода;
		НачалоГода 		= НачалоГода + 60 * 60 * 24;
	КонецЦикла;
	
	НЗ.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти