
#Область ПрограммныйИнтерфейс
#Если НаСервере Тогда

// Инициализировать.
// 
// Параметры:
//  Наименование - Строка -  Имя пользователя
// 
// Возвращаемое значение:
//  СправочникСсылка.ПерсональныеНастройки -  Создает и возвращает элемент персональных настроек пользователя
Функция Инициализировать(Знач Наименование = "") Экспорт
	
	НовыеНастройки 				= СоздатьЭлемент();
	НовыеНастройки.Наименование = "ПН - " + Наименование;
	НовыеНастройки.Записать();
	
	Возврат НовыеНастройки.Ссылка;
	
КонецФункции

#КонецЕсли
#КонецОбласти