#Область ПрограммныйИнтерфейс

// Сформировать картинку дня рождения.
// 
// Параметры:
//  Человек - СправочникСсылка.Люди - Человек
// 
// Возвращаемое значение:
//  Строка -  Путь к картинке дня рождения
Функция СформироватьКартинкуДняРождения(Знач Человек) Экспорт
	
	РП    = """ """;
	КП    = """";
	НВ    = "magick """;
	
	ОбъектАвтор = Человек.ПолучитьОбъект();
	ДД          = ОбъектАвтор.Фото.Получить();
	
	Если ЗначениеЗаполнено(ДД) Тогда
		
		Путь        = ПолучитьИмяВременногоФайла("jpg");  
		ОбъектДР    = Справочники.Файлы.ДР.ПолучитьОбъект();
		Маска       = ОбъектДР.Файл.Получить();
		ПутьМаска   = ПолучитьИмяВременногоФайла("png");
		
		ДД.Записать(Путь);
		Маска.Записать(ПутьМаска);
		
		Если ОбъектАвтор.ОсновноеСообщество = Справочники.Сообщества.Athenaeum
			Или ОбъектАвтор.ОсновноеСообщество = Справочники.Сообщества.Тест Тогда
			
			ИмяСкрипта     = ПолучитьИмяВременногоФайла(".ps1");
			ТекстСкрипта   = Новый ТекстовыйДокумент();
			
			ТекстСкрипта.УстановитьТекст(
			"convert -resize 1143x643 """ 
			+ Путь 
			+ РП 
			+ Путь 
			+ КП 
			+ Символы.ПС 
			+ НВ 
			+ Путь 
			+ РП 
			+ ПутьМаска 
			+ КП 
			+ " -grayscale Rec709Luminance  -geometry 1143x643 -gravity Center -composite """ 
			+ Путь
			+ КП 
			+ Символы.ПС 
			+ НВ 
			+ Путь 
			+ """ -pointsize 50 -fill white -font Sylfaen -gravity Center -annotate +0+70 '" 
			+ ОбъектАвтор.Имя 
			+ " " 
			+ ОбъектАвтор.Фамилия 
			+ "' """ 
			+ Путь 
			+ КП 
			+ Символы.ПС 
			+ НВ 
			+ Путь 
			+ """ -pointsize 24 -fill white -font Tahoma -gravity Center -annotate +0+117 '" 
			+ Формат(ОбъектАвтор.ДР, "ДЛФ=DD") 
			+ "' """ 
			+ Путь 
			+ КП        
			);
			
			ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
			
			КодВозврата = 0;
			ЗапуститьПриложение("powershell -file " + ИмяСкрипта, , Истина, КодВозврата);
			УдалитьФайлы(ИмяСкрипта);
			УдалитьФайлы(ПутьМаска);
			
		КонецЕсли;
		
		КартинкаДД = Новый ДвоичныеДанные(Путь);
		УдалитьФайлы(Путь);
		Возврат КартинкаДД;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Создает копии с разными размерами в папке оригинала
// 
// Параметры:
//  ПутьКОригиналу - Строка - Путь к оригиналу
Процедура СоздатьКарточки(Знач ПутьКОригиналу) Экспорт
    
    Картинка        = Новый Файл(ПутьКОригиналу);
    Путь            = Картинка.Путь;
    Размеры         = Новый Соответствие;
    WEBP            = ".webp";
    
    Размеры.Вставить("small"    , "175x270");
    Размеры.Вставить("medium"   , "295x455");
    
    Для Каждого Размер Из Размеры Цикл
        
        РазмерМассив  = СтрРазделить(Размер.Значение, "x");
        Ширина        = РазмерМассив[0];
        
        ИмяСкрипта    = ПолучитьИмяВременногоФайла(".ps1");
        ТекстСкрипта  = Новый ТекстовыйДокумент();
        
        ТекстСкрипта.УстановитьТекст(
        "magick convert -resize " + Ширина + "x -unsharp 0x0.55+0.55+0.008 -quality 90 "
        + ПутьКОригиналу 
        + " "
        + Путь 
        + Размер.Ключ 
        + WEBP 
        + Символы.ПС +   
        "convert "
        + Путь 
        + Размер.Ключ
        + WEBP
        + " -resize " + Размер.Значение + "! -gravity North -extent " + Размер.Значение + " "
        + Путь 
        + Размер.Ключ
        + WEBP
        );
        
        ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);                
        КодВозврата = 0;
        ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", , Истина, КодВозврата);
        
        УдалитьФайлы(ИмяСкрипта);
        
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти
