
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Финансы.Записывать = Истина;
	Движение = Движения.Финансы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Источник = Затрата;
	Движение.Валюта = Валюта;
	Движение.СуммаВВалюте = Сумма;
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата0, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Дата0", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Движение.Сумма = Сумма * ВыборкаДетальныеЗаписи.Курс;
		
	Иначе
		
		Движение.Сумма = Сумма;
		
	КонецЕсли;
	
КонецПроцедуры
