
&НаКлиенте
Процедура Собрать(Команда)
	СобратьНаСервере(ПапкаСайта);	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СобратьНаСервере(ПапкаСайта)
	
	Если Не СтрЗаканчиваетсяНа(ПапкаСайта, "\") Тогда
		ПапкаСайта = ПапкаСайта + "\";	
	КонецЕсли;
	
	Выборка 	= Справочники.СтруктураСайта.Выбрать();
	МассивСайта = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивСайта.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	УдалитьОбъекты(МассивСайта);
	
	Корень = НайтиФайлы(ПапкаСайта,"*",Истина);
	СоответствиеКаталогов = Новый Соответствие;
		
	Для Каждого Каталог Из Корень Цикл
		
		Если ЗначениеЗаполнено(Каталог.Расширение) И ЗначениеЗаполнено(Каталог.ИмяБезРасширения)  Тогда 
			Продолжить;
		Иначе
			ПутьКаталога 			= СтрЗаменить(Каталог.ПолноеИмя, ПапкаСайта, "");
			МассивПодкаталогов  	= СтрРазделить(ПутьКаталога, "\", Ложь);
			ПредыдущийПодкаталог    = "";
			Счетчик					= 0;
	
			Для Каждого Подкаталог Из МассивПодкаталогов Цикл
				
				ПолныйПутьКаталога = "";
				
				Для Н = 0 По Счетчик Цикл
			
					ПолныйПутьКаталога = ПолныйПутьКаталога + МассивПодкаталогов[Н] + "\";

				КонецЦикла;

				СуществующийКаталог = СоответствиеКаталогов.Получить(ПолныйПутьКаталога);
				
				
				Если СуществующийКаталог <> Неопределено Тогда
					ПредыдущийПодкаталог = СуществующийКаталог;
				Иначе
					НовыйПодкаталог = Справочники.СтруктураСайта.СоздатьГруппу();
					НовыйПодкаталог.Наименование 	= Подкаталог;
					НовыйПодкаталог.Родитель		= ?(ЗначениеЗаполнено(ПредыдущийПодкаталог), ПредыдущийПодкаталог, "");
					НовыйПодкаталог.Записать();
					
					ПредыдущийПодкаталог			= НовыйПодкаталог.Ссылка;
							
					СоответствиеКаталогов.Вставить(ПолныйПутьКаталога, ПредыдущийПодкаталог);
					
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	                             
	Для Каждого Файл Из Корень Цикл
		Если Не ЗначениеЗаполнено(Файл.Расширение) Или Не ЗначениеЗаполнено(Файл.ИмяБезРасширения) Или СтрЧислоВхождений(Файл.Имя, ".") > 1  Тогда 
			Продолжить;
		Иначе
			ПутьБезКорня = СтрЗаменить(Файл.Путь, ПапкаСайта, "");
			
			НовыйФайл = Справочники.СтруктураСайта.СоздатьЭлемент();
			НовыйФайл.Наименование = Файл.Имя; 
			
			Если ЗначениеЗаполнено(ПутьБезКорня) Тогда
				НовыйФайл.Родитель = СоответствиеКаталогов.Получить(ПутьБезКорня);
			КонецЕсли;
			
			НовыйФайл.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПапкаСайта = Константы.ПапкаСайта.Получить();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Константы.ПапкаСайта.Установить(ПапкаСайта);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры
