#Область  ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗатратаПриИзменении(Элемент)
	ЗатратаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗатратаПриИзмененииНаСервере()
	
	РеквизитыЗатрата = ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Затрата
							, "СтандартнаяСумма,СтандартнаяВалюта");
	Объект.Сумма 	= РеквизитыЗатрата.СтандартнаяСумма;
	Объект.Валюта 	= РеквизитыЗатрата.СтандартнаяВалюта;
	
КонецПроцедуры

#КонецОбласти
