#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьКартинку();
КонецПроцедуры

#КонецОбласти




#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	Диалог 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок 		= "Выбирите файл";
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);

КонецПроцедуры

&НаКлиенте
Процедура ОтступМаркиПриИзменении(Элемент)
	Записать();
	Закрыть();
	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ЭтотОбъект));
КонецПроцедуры

#КонецОбласти




#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда	
		Объект.Картинка = ВыбранныеФайлы[0];
		ЗаписатьДвоичныеДанныеФайла(Новый ДвоичныеДанные(Объект.Картинка));	
		
		Закрыть();
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвоичныеДанныеФайла(ДД)
	
	Записать();
	ОбъектПост 				= Объект.Ссылка.ПолучитьОбъект();
	ОбъектПост.КартинкаДД 	= Новый ХранилищеЗначения(ДД);
	ОбъектПост.Записать();
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьКартинку()
	
	Попытка
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		КартинкаСобытия = ПоместитьВоВременноеХранилище(МетодыОбработкиИзображений.СформироватьСобытие(Объект.Ссылка, Объект.Сообщество), Новый УникальныйИдентификатор);
	КонецЕсли;
	Исключение 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ("Нет картинки");
		Сообщение.Сообщить();
	КонецПопытки;

КонецПроцедуры

#КонецОбласти


