#Область ПрограммныйИнтерфейс

Функция СоздатьПост(Знач Пост = "", Знач СтруктураЗаписи = "", Знач Сообщество) Экспорт
	
	Параметры = Новый Структура;
	Файлы = Новый Массив;
	
	Токен	= Сообщество.ТГ_token;
	Чат     = Сообщество.ТГ_chat_id;
	
	Параметры.Вставить("token"	, Токен);
	Параметры.Вставить("chat_id", Чат);
	
	Если ЗначениеЗаполнено(Пост) Тогда
		
		ДД 	= Пост.КартинкаДвоичные.Получить();
		ИВФ = ПолучитьИмяВременногоФайла(".png");
		
		Если Пост.ВидКартинки = Перечисления.ВидыКартинок.Одиночная Или Не ЗначениеЗаполнено(Пост.ВидКартинки) Тогда
										
			Если Не ЗначениеЗаполнено(ДД) Тогда
				Файлы.Добавить(?(ТипЗнч(Пост) = Тип("Соответствие"), Пост[Строка("Картинка")], Пост.Картинка));
			Иначе
				ДД.Записать(ИВФ);
				Файлы.Добавить(?(ТипЗнч(Пост) = Тип("Соответствие"), Пост[Строка("Картинка")], ИВФ));
			КонецЕсли;
			
		ИначеЕсли Пост.ВидКартинки = Перечисления.ВидыКартинок.Галерея Тогда
			
			ДД.Записать(ИВФ);
			
			МассивКартинок = РаботаССистемойСервер.СформироватьГалерею(ИВФ);
			
			Для Каждого КартинкаГалереи Из МассивКартинок Цикл
				
				Файлы.Добавить(КартинкаГалереи);
				
			КонецЦикла;
			
			
		ИначеЕсли Пост.ВидКартинки = Перечисления.ВидыКартинок.Термин Тогда
			Файлы.Добавить(РаботаССистемойСервер.СформироватьТермин(Пост.Содержание));
		ИначеЕсли Пост.ВидКартинки = Перечисления.ВидыКартинок.Событие Тогда
			Файлы.Добавить(РаботаССистемойСервер.СформироватьСобытие(Пост.Содержание, Пост.Сообщество));
		КонецЕсли;
		Параметры.Вставить(
		"caption"
		, ?(ТипЗнч(Пост) = Тип("Соответствие"), Строка(ТекущаяДатаСеанса()), ФормированиеПостовСервер.СформироватьТекстПоста(Пост)));
		
	Иначе
		
		Файлы.Добавить(СтруктураЗаписи.Картинка);
		Параметры.Вставить("caption", СтруктураЗаписи.Текст);
		
		
	КонецЕсли;
	
	//Параметры.Вставить("parse_mode", "HTML");
	Параметры.Вставить("photo"	, Файлы);
	
	Если Файлы.Количество() = 1 Тогда
		Ответ = ТГ_Апи.sendPhoto(Параметры);
	Иначе
		Ответ = ТГ_Апи.sendMediaGroup(Параметры);
	КонецЕсли;
	
	Если Файлы.Количество() = 1 Тогда
		НомерПоста = Ответ["result"]["message_id"];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пост) И ТипЗнч(Пост) = Тип("ДокументСсылка.Пост") Тогда
		ОбъектПост = Пост.ПолучитьОбъект();
		ОбъектПост.ТГ_НомерПоста = НомерПоста;
		ОбъектПост.Записать();
	КонецЕсли;
	
	Возврат НомерПоста
	
КонецФункции

Функция ОтправитьСообщение(Идентификатор, Сообщение, Дополнение = "Страницы", ПользовательИБ) Экспорт
	
	Токен  		= Справочники.Сообщества.Athenaeum.TGB_token; 
	Апи  		= "api.telegram.org";
	
	МассивСимволов = Новый Соответствие;
	МассивСимволов.Вставить("<", "&lt;");
	МассивСимволов.Вставить(">", "&gt;");
	МассивСимволов.Вставить("&", "&amp;");
	МассивСимволов.Вставить("_", " ");
	МассивСимволов.Вставить("[", "(");
	МассивСимволов.Вставить("]", ")");
	
	Для Каждого СимволМассива Из МассивСимволов Цикл
		Сообщение = СтрЗаменить(Сообщение, СимволМассива.Ключ, СимволМассива.Значение);
	КонецЦикла;
	
	Ресурс 	= "bot"                                            
	+ Токен 
	+ "/sendMessage?chat_id=" 
	+ СтрЗаменить(Формат(Идентификатор, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") 
	+ "&text="
	+ СокрЛП(Сообщение);
	
	Если Дополнение = "Страницы" Тогда
		
		Строки = Новый Массив;
		Кнопки = Новый Массив;
		
		Кнопки.Добавить(Новый Структура("text,callback_data","<-"	,"<-"));
		Кнопки.Добавить(Новый Структура("text,callback_data","->"	,"->"));
		
		Строки.Добавить(Кнопки);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,,,ЭкранированиеСимволовJSON.СимволыВнеASCII));
		ЗаписатьJSON(ЗаписьJSON, Новый Структура("keyboard,resize_keyboard",Строки, Истина));
		
		КлавВСообщ = ЗаписьJSON.Закрыть();
		
		Ресурс = Ресурс 
		+ "&parse_mode=Markdown"
		+ "&reply_markup=" + КлавВСообщ;
		
		
	ИначеЕсли Дополнение = "Скрыть" Тогда
		
		Ресурс = Ресурс
		+ "&parse_mode=Markdown"
		+ "&reply_markup={""hide_keyboard"":true}";
		
	КонецЕсли;
	
	Соединение  = Новый HTTPСоединение(Апи,443,,,,100,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос 		= Новый HTTPЗапрос(Ресурс);
	
	Ответ = Соединение.Получить(Запрос);  
	
	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ.ПолучитьТелоКакСтроку()
	,Перечисления.СоцСети.Telegram
	,Апи);
	
	РегистрыСведений.Диалоги.ЗаписатьСообщениеДиалога(
	Справочники.Пользователи.Ферапонт
	, ПользовательИБ
	, Перечисления.СоцСети.Telegram
	, Сообщение);
	
	Возврат Ответ.ПолучитьТелоКакСтроку();
	
КонецФункции

Функция ОтправитьСложнопост(Знач Сложнопост, Знач Сообщество) Экспорт
	
	Параметры = Новый Структура;
	Файлы = Новый Массив;
	
	Токен	= Сообщество.ТГ_token;
	Чат     = Сообщество.ТГ_chat_id;
	
	Для Каждого Ресурс Из Сложнопост.Ресурсы Цикл

		ИВФ = ПолучитьИмяВременногоФайла("png");
		
		СтруктураМедиа = Новый Структура;
		СтруктураМедиа.Вставить("МедиаДД", 	Ресурс.МедиаДД.Получить());
		СтруктураМедиа.Вставить("Медиа",	Ресурс.Медиа);
		СтруктураМедиа.Вставить("ТекстА",	Ресурс.ТекстА);
		СтруктураМедиа.Вставить("ТекстБ",	Ресурс.ТекстБ);
		СтруктураМедиа.Вставить("ТекстВ",	Ресурс.ТекстВ);
			
		Медиа = МетодыОбработкиИзображений.ОбработатьКартинкуПоШаблону(Ресурс.ВидОбработки, СтруктураМедиа);
	
		Файлы.Добавить(Медиа);
		
	КонецЦикла;

	
	Параметры.Вставить("token"	, Токен);
	Параметры.Вставить("chat_id", Чат);
	Параметры.Вставить("caption", Сложнопост.Текст);
	Параметры.Вставить("photo"	, Файлы);
	
	Ответ = ТГ_Апи.sendMediaGroup(Параметры);

	Возврат Ответ;
	
КонецФункции
#КонецОбласти
