#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КартинкаОткрытие(Элемент, СтандартнаяОбработка)
		
	СтандартнаяОбработка 	= Ложь;
	Диалог 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок 		= "Выбирите файл";
	Диалог.Каталог			= "G:\Мой диск\Aioniotis\Картинки";
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		Если ТекущийЭлемент.Имя = "Фото" Тогда
			
			Объект.ПутьКФото = ВыбранныеФайлы[0];
			ЗаписатьДвоичныеДанныеКартинки(Новый ДвоичныеДанные(Объект.ПутьКФото), "Фото");

		ИначеЕсли ТекущийЭлемент.Имя = "Портрет" Тогда
			
			Объект.Портрет = ВыбранныеФайлы[0];
			ЗаписатьДвоичныеДанныеКартинки(Новый ДвоичныеДанные(Объект.Портрет), "КартинкаДвоичные");
			
		КонецЕсли;
		
		Закрыть();
	  	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвоичныеДанныеКартинки(ДД, Реквизит)
	
	Записать();
	ОбъектПост 					= Объект.Ссылка.ПолучитьОбъект();
	ОбъектПост[Реквизит] = Новый ХранилищеЗначения(ДД);
	ОбъектПост.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьККартинке = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Фото");
КонецПроцедуры


#КонецОбласти


