#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Запостить(Команда)
	
	ТД = Элементы.Список.ТекущиеДанные;
	
	ПоляЗаписи = Новый Структура;
	ПоляЗаписи.Вставить("Период"	, ТД.Период);
	ПоляЗаписи.Вставить("Пост"		, ТД.Пост); 
	ПоляЗаписи.Вставить("Автор"		, ТД.Автор);
	ПоляЗаписи.Вставить("Вид"		, ТД.Вид);
	
	ЗапоститьНаСервере(ПоляЗаписи);
	
КонецПроцедуры

#Если Не ВебКлиент Тогда
&НаКлиенте
Процедура ОткрытьПост(Команда)
	ОткрытьЗначение(Элементы.Список.ТекущиеДанные.Пост);
КонецПроцедуры
#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗапоститьНаСервере(ПоляЗаписи)
		
	Запись = РегистрыСведений.ПорядокПостов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПоляЗаписи);
	Запись.ДатаПубликации = ТекущаяДатаСеанса();
	Запись.Опубликован = Истина;
	Запись.Записать(Истина);   
	
	ВК_Действия.Запостить(ПоляЗаписи.Пост,, ПоляЗаписи.Пост.Сообщество);
	ТГ_Действия.СоздатьПост(ПоляЗаписи.Пост,, ПоляЗаписи.Пост.Сообщество);
	 
КонецПроцедуры

#КонецОбласти