#Область СлужебныйПрограммныйИнтерфейс

// Создание рекламной компании
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция ads_createCampaigns(Параметры) Экспорт

	Линк = "https://api.vk.com/method/ads.createCampaigns";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Создание рекламной Записи
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция ads_createAds(Параметры) Экспорт

	Линк = "https://api.vk.com/method/ads.createAds";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Возвращает набор подсказок для настройки таргетинговой рекламы
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция ads_getSuggestions(Параметры) Экспорт

	Линк = "https://api.vk.com/method/ads.getSuggestions";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Возвращает список рекламных объявлений
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция ads_getAds(Параметры) Экспорт

	Линк = "https://api.vk.com/method/ads.getAds";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции
 
// Изменяет информацию в существующей рекламной записи
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция ads_updateAds(Параметры) Экспорт

	Линк = "https://api.vk.com/method/ads.updateAds";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Ставит лайк записи
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция likes_add(Параметры) Экспорт

	Линк = "https://api.vk.com/method/likes.add";

	Параметры.Вставить("type", "post");

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Отправляет личное сообщение
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция message_send(Параметры) Экспорт

	Линк = "https://api.vk.com/method/messages.send";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Получает адрес для загрузки фотографии перед публикацией на стену
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция photos_getWallUploadServer(Параметры) Экспорт

	Линк = "https://api.vk.com/method/photos.getWallUploadServer";
	
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("group_id", Параметры["owner_id"]);

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции
 
// Сохраняет фото для создания поста
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция photos_saveWallPhoto(Параметры) Экспорт

	Линк = "https://api.vk.com/method/photos.saveWallPhoto";
	
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("group_id", Параметры["owner_id"]);
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("gid", Параметры["owner_id"]);

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Получает адрес для загрузки фото в альбом
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция photos_getUploadServer(Параметры) Экспорт

	Линк = "https://api.vk.com/method/photos.getUploadServer";
	
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("group_id", Параметры["owner_id"]);
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("gid", Параметры["owner_id"]);

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Сохраняет фото в альбом
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция photos_save(Параметры) Экспорт

	Линк = "https://api.vk.com/method/photos.save";
	
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("group_id", Параметры["owner_id"]);
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("gid", Параметры["owner_id"]);

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Создает альбом для фотографий
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция photos_createAlbum(Параметры) Экспорт

	Линк = "https://api.vk.com/method/photos.createAlbum";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Создает опрос
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция polls_create(Параметры) Экспорт

	Линк = "https://api.vk.com/method/polls.create";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Получает адрес для загрузки фона опроса
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция polls_getPhotoUploadServer(Параметры) Экспорт

	Линк = "https://api.vk.com/method/polls.getPhotoUploadServer";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Сохраняет фон опроса
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция polls_savePhoto(Параметры) Экспорт

	Линк = "https://api.vk.com/method/polls.savePhoto";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Получает общую статистику по группе
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция stats_get(Параметры) Экспорт

	Линк = "https://api.vk.com/method/stats.get";
	
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("group_id", Параметры["owner_id"]);

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Получает статистику по постам
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция stats_getPostReach(Параметры) Экспорт

	Линк = "https://api.vk.com/method/stats.getPostReach";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Получает адрес для загрузки фото в историю
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция stories_getPhotoUploadServer(Параметры) Экспорт

	Линк = "https://api.vk.com/method/stories.getPhotoUploadServer";

	Параметры.Вставить("add_to_news", "1");
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("group_id", Параметры["owner_id"]);

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Создает историю
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция stories_save(Параметры) Экспорт

	Линк = "https://api.vk.com/method/stories.save";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Получает нформацию о пользователе
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция users_get(Параметры) Экспорт

	Линк = "https://api.vk.com/method/users.get";

	ПараметрыОтвета = КоннекторHTTP.GetJson(getUserToken(Параметры), Параметры);
	Параметры.Вставить("access_token", ПараметрыОтвета["access_token"]);

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Создает короткую ссылку vk.cc
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция utils_getShortLink(Параметры) Экспорт

	Линк = "https://api.vk.com/method/utils.getShortLink";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Создает пост
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция wall_post(Параметры) Экспорт

	Линк = "https://api.vk.com/method/wall.post";

	Параметры.Вставить("friends_only", "0");
	//@skip-check wrong-string-literal-content
	Параметры.Вставить("owner_id", "-" + Параметры["owner_id"]);
	Параметры.Вставить("from_group", "1");
	Параметры.Вставить("signed", "0");
	Параметры.Вставить("topic_id", "1");

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Удаляет пост
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция wall_delete(Параметры) Экспорт

	Линк = "https://api.vk.com/method/wall.delete";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Делает репост
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция wall_repost(Параметры) Экспорт

	Линк = "https://api.vk.com/method/wall.repost";

	Параметры.Вставить("mark_as_ads", 0);

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции

// Получает последние записи со стены
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ VK
Функция wall_get(Параметры) Экспорт

	Линк = "https://api.vk.com/method/wall.get";

	Ответ = КоннекторHTTP.GetJson(Линк, Параметры);

	ИнструментарийВызовСервера.ЗаписьВОтветыАпи(Ответ, Перечисления.СоцСети.VK, Линк);

	Возврат Ответ;

КонецФункции
#Область Дополнительные

// Получает код для авторизации
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  Строка - Ссылка для получения кода
Функция autorize(Параметры) Экспорт

	CI = "client_id";
	Возврат "https://oauth.vk.com/authorize?client_id=" + Параметры[CI]
		+ "&scope=offline,wall,groups,photos,stats,ads&v=5.60&response_type=token&redirect_uri=https://api.vk.com/blank.html";
КонецФункции
 
// Получает токен доступа
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  Строка - Ссылка для получения токена
Функция getAccess_token(Параметры) Экспорт

	CI = "client_id";
	CS = "client_secret";
	RC = "response_code";

	Возврат "https://oauth.vk.com/access_token?client_id=" + Параметры[CI] + "&client_secret=" + Параметры[CS] + "&redirect_uri=https://api.vk.com/blank.html&code="
		+ Параметры[RC];

КонецФункции
	
// Получает токен приложения
// 
// Параметры:
//  Параметры - Структура - параметры HTTP запроса
// 
// Возвращаемое значение:
//  Строка - Ссылка для получения токена	
Функция getUserToken(Параметры) Экспорт

	Параметры.Вставить("client_id"		, "51654824");
	Параметры.Вставить("client_secret"	, "g9E89rlrU2Qzw6fj7b24");

	RU = "redirect_url";
	RC = "response_code";

	Возврат "https://oauth.vk.com/access_token?client_id=" + Параметры["client_id"] + "&client_secret="
		+ Параметры["client_secret"] + "&redirect_uri=" + Параметры[RU] + "&code=" + Параметры[RC];
КонецФункции

#КонецОбласти

#КонецОбласти