#Область ПрограммныйИнтерфейс

Процедура ОбновитьКнигу(Книга) Экспорт
	
	МассивКниги = Новый Массив;
	МассивКниги.Добавить(Книга);
	ОбновитьСтраницыКниг(МассивКниги);
	
	МассивАвтора = Новый Массив;
	МассивАвтора.Добавить(Книга.Автор);
	ОбновитьСтраницыАвторов(МассивАвтора);
	
	СформироватьIndex();
	СформироватьСайтмап();
	
КонецПроцедуры

Процедура ОбновитьСтраницыКниг(СписокКниг) Экспорт 
	
	КаталогСайта 			= Справочники.Сайты.Athenaeum.ПапкаДанныхСайта;
	
	Для Каждого Книга Из СписокКниг Цикл
		
		ПоляКниги 	= ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Книга, "Наименование,Автор,Описание,Код,НаСайте");
		ПоляАвтора	= ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(ПоляКниги["Автор"], "Имя,Фамилия,Код");
		
		Если Не ПоляКниги["НаСайте"] Тогда
			Продолжить;	
		КонецЕсли;
		
		СтруктураКниги = Новый Структура;
		СтруктураКниги.Вставить("title"			, ПоляКниги.Наименование);
		СтруктураКниги.Вставить("author"		, ПоляАвтора.Имя + " " + ПоляАвтора.Фамилия);
		СтруктураКниги.Вставить("description"	, СтрЗаменить(ПоляКниги.Описание, Символы.ПС, "<br/>"));
		СтруктураКниги.Вставить("id"			, ПоляКниги.Код);
		СтруктураКниги.Вставить("author_id"		, ПоляАвтора.Код);
		
		ПутьККниге		= КаталогСайта + "\books\" + ПоляКниги.Код;
		КаталогКниги 	= Новый Файл(ПутьККниге);
		
		Если Не КаталогКниги.Существует() Тогда
			СоздатьКаталог(ПутьККниге);
		КонецЕсли;
		
		ДД 	= Книга.КартинкаДвоичные.Получить();
		ДД.Записать(КаталогКниги.ПолноеИмя + "\0.webp");
		МетодыОбработкиИзображений.СоздатьКарточки(КаталогКниги.ПолноеИмя + "\0.webp");

		ИнструментарийВызовСервера.JSONВФайл(СтруктураКниги, ПутьККниге + "\data.json"); 

	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСтраницыАвторов(СписокАвторов) Экспорт
	
	Произведения = ПолучитьСписокКнигАвторов(СписокАвторов);
	КаталогСайта = Справочники.Сайты.Athenaeum.ПапкаДанныхСайта;
	
	Для Каждого Автор Из СписокАвторов Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Автор", Автор);
		
		ПоляАвтора			= ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Автор, "Имя,Фамилия,Код,ДР");
		КаталогАвтора 		= Новый Файл(КаталогСайта + "\authors\" + ПоляАвтора.Код);
		ПроизведенияАвтора  = Произведения.НайтиСтроки(Отбор);
		СтруктураАвтора 	= Новый Структура;
		ВерсткаБио			= Новый ТекстовыйДокумент;
		
		Если Не КаталогАвтора.Существует() Тогда
			СоздатьКаталог(КаталогАвтора.ПолноеИмя);
		КонецЕсли;
				
		ДД = Автор.КартинкаДвоичные.Получить();
		ДД.Записать(КаталогАвтора.ПолноеИмя + "\0.webp");
		
		СтруктураАвтора.Вставить("author"	, ПоляАвтора.Имя + " " + ПоляАвтора.Фамилия);
		СтруктураАвтора.Вставить("date"		, Формат(ПоляАвтора.ДР,"ДЛФ=DD"));
		
		Для Каждого ОписаниеАвтора Из Автор.Абзацы Цикл	
			ВерсткаБио.ДобавитьСтроку("<h4>" 	+ ОписаниеАвтора.Заголовок + ":</h4>");
			ВерсткаБио.ДобавитьСтроку("<p>" 	+ ОписаниеАвтора.Содержание + "</p>");		
		КонецЦикла;
		
		ВерсткаБио.ДобавитьСтроку("<h4>Произведения:</h4><div class=""books-list"">");
	
		Для Каждого ПроизведениеАвтора Из ПроизведенияАвтора Цикл		
			ВерсткаБио.ДобавитьСтроку("<a href=""/book?id="+ ПроизведениеАвтора.Код +""" class=""list-group-item list-group-item-action""><div class=""result""><span class=""oi oi-book result-oi""></span><span class=""result-text"">" + ПроизведениеАвтора.Наименование + "</span></div></a>")
		КонецЦикла;
		
		ВерсткаБио.ДобавитьСтроку("</div>");
	
		ИнструментарийВызовСервера.JSONВФайл(СтруктураАвтора, КаталогАвтора.ПолноеИмя + "\data.json"); 
		ВерсткаБио.Записать(КаталогАвтора.ПолноеИмя + "\description.html");
		
	КонецЦикла;
	
	ОбновитьКаталогАвторов();
	
КонецПроцедуры

Процедура СформироватьIndex() Экспорт
	
	МассивКниг 	= Новый Массив;	
	Запрос 		= Новый Запрос(
		"ВЫБРАТЬ
		|	Произведения.Код КАК Код,
		|	Произведения.Наименование КАК Наименование,
		|	Произведения.Автор.Имя КАК АвторИмя,
		|	Произведения.Автор.Фамилия КАК АвторФамилия
		|ИЗ
		|	Справочник.Произведения КАК Произведения
		|ГДЕ
		|	Произведения.НаСайте = ИСТИНА");
	
	ВыборкаДетальныеЗаписи 	= Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураКниги = Новый Структура;
		СтруктураКниги.Вставить("title"		, ВыборкаДетальныеЗаписи.Наименование);
		СтруктураКниги.Вставить("name"		, ВыборкаДетальныеЗаписи.АвторИмя);
		СтруктураКниги.Вставить("surname"	, ВыборкаДетальныеЗаписи.АвторФамилия);
		СтруктураКниги.Вставить("url"		, "/book?id=" + ВыборкаДетальныеЗаписи.Код);
		
		МассивКниг.Добавить(СтруктураКниги);
		
	КонецЦикла;
	
	ИнструментарийВызовСервера.JSONВФайл(МассивКниг, Справочники.Сайты.Athenaeum.ПапкаДанныхСайта + "\search.json"); 
		
КонецПроцедуры

Процедура СформироватьСайтмап() Экспорт
	
	Дата = Формат(УниверсальноеВремя(ТекущаяДатаСеанса()), "ДФ=yyyy-MM-ddThh:mm:ss+00:00");
	
	Текст = 
	"<?xml version=""1.0"" encoding=""UTF-8""?>
	|<urlset
    |xmlns=""http://www.sitemaps.org/schemas/sitemap/0.9""
    |xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""
	|>";
	
	Запрос 	= Новый Запрос(ПолучитьСписокСтраниц());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Текст = Текст 
			+ Символы.ПС
			+ "<url>"
			+ Символы.ПС
			+ "<loc>"
			+ Выборка.URL
			+ "</loc>"
			+ Символы.ПС
			+ "<lastmod>"
			+ Дата
			+ "</lastmod>"
			+ Символы.ПС
			+ "</url>";
			
	КонецЦикла;
	
	Текст = Текст + "</urlset>";
	
	Сайтмап = Новый ТекстовыйДокумент;
	Сайтмап.ДобавитьСтроку(Текст);
	Сайтмап.Записать(Справочники.Сайты.Athenaeum.КореньСайта + "sitemap.xml");
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокКнигАвторов(СписокАвторов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Произведения.Автор КАК Автор,
		|	Произведения.Ссылка КАК Книга,
		|	Произведения.Код КАК Код,
		|	Произведения.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Произведения КАК Произведения
		|ГДЕ
		|	Произведения.Автор В(&СписокАвторов)
		|	И Произведения.НаСайте";
	
	Запрос.УстановитьПараметр("СписокАвторов", СписокАвторов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСписокСтраниц() 
	
		Возврат	"ВЫБРАТЬ
		       	|	""https://athenaeum.digital/book?id="" + Произведения.Код КАК URL,
		       	|	Произведения.Автор КАК Автор
		       	|ПОМЕСТИТЬ Произведения
		       	|ИЗ
		       	|	Справочник.Произведения КАК Произведения
		       	|ГДЕ
		       	|	Произведения.НаСайте = ИСТИНА
		       	|;
		       	|
		       	|////////////////////////////////////////////////////////////////////////////////
		       	|ВЫБРАТЬ РАЗЛИЧНЫЕ
		       	|	""https://athenaeum.digital/author?id="" + Произведения.Автор.Код КАК URL
		       	|ПОМЕСТИТЬ Авторы
		       	|ИЗ
		       	|	Произведения КАК Произведения
		       	|;
		       	|
		       	|////////////////////////////////////////////////////////////////////////////////
		       	|ВЫБРАТЬ
		       	|	Произведения.URL КАК URL
		       	|ИЗ
		       	|	Произведения КАК Произведения
		       	|
		       	|ОБЪЕДИНИТЬ ВСЕ
		       	|
		       	|ВЫБРАТЬ
		       	|	Авторы.URL
		       	|ИЗ
		       	|	Авторы КАК Авторы
		       	|
		       	|ОБЪЕДИНИТЬ ВСЕ
		       	|
		       	|ВЫБРАТЬ
		       	|	СтандартныеСтраницы.Наименование
		       	|ИЗ
		       	|	Справочник.СтандартныеСтраницы КАК СтандартныеСтраницы";
	
КонецФункции

Процедура ОбновитьКаталогАвторов()
	
	Запрос 			= Новый Запрос;
	КаталогСайта 	= Справочники.Сайты.Athenaeum.ПапкаДанныхСайта;

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Произведения.Автор КАК Автор,
		|	Произведения.Автор.Имя КАК АвторИмя,
		|	Произведения.Автор.Фамилия КАК АвторФамилия,
		|	Произведения.Автор.Код КАК АвторКод
		|ИЗ
		|	Справочник.Произведения КАК Произведения
		|ГДЕ
		|	Произведения.НаСайте";
	
	РезультатЗапроса 		= Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	МассивАвторов			= Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураАвтора = Новый Структура;
		СтруктураАвтора.Вставить("name"		, ВыборкаДетальныеЗаписи.АвторИмя);
		СтруктураАвтора.Вставить("surname"	, ВыборкаДетальныеЗаписи.АвторФамилия);
		СтруктураАвтора.Вставить("url"		, "/author?id=" + ВыборкаДетальныеЗаписи.АвторКод);
		
		МассивАвторов.Добавить(СтруктураАвтора);
		
	КонецЦикла;

	ИнструментарийВызовСервера.JSONВФайл(МассивАвторов, КаталогСайта + "\authors.json");
	
КонецПроцедуры

#КонецОбласти



