Функция ОбработатьКартинкуПоШаблону(Знач ВидОбработки, Знач СтруктураОбработки, Знач ВозвращатьДД = Ложь) Экспорт
	
	НаименованиеВида = ВидОбработки.Наименование;
	
	ТекстА = СтруктураОбработки["ТекстА"];
	ТекстБ = СтруктураОбработки["ТекстБ"];
	ТекстВ = СтруктураОбработки["ТекстВ"];
	
	Путь 	= ПолучитьИмяВременногоФайла("png");
	
	Если ТипЗнч(СтруктураОбработки["Медиа"]) = Тип("СправочникСсылка.Файлы") Тогда
		ОбъектМедиа = СтруктураОбработки["Медиа"].ПолучитьОбъект();
		ДД			= ОбъектМедиа.Файл.Получить();
	Иначе
		ДД		= СтруктураОбработки["МедиаДД"];
	КонецЕсли;
	
	ДД.Записать(Путь);
	
	Если НаименованиеВида = "Заголовок притчи" Тогда
		Метод_ЗаголовокПритчи(ТекстА, ТекстБ, Путь);
		
	ИначеЕсли НаименованиеВида = "Основной текст притчи" Тогда
		Метод_ОсновнойТекстПритчи(ТекстА, Путь);		
	КонецЕсли;
	
	Если ВозвращатьДД Тогда
		ДД 	= Новый ДвоичныеДанные(Путь);
		УдалитьФайлы(Путь);
		Возврат ДД;
	Иначе     
		Возврат Путь;
	КонецЕсли;
	
КонецФункции

Процедура Метод_ЗаголовокПритчи(Знач ТекстА, Знач ТекстБ, Знач Путь) 
	
	
	РазмерЗаголовка			= 74;
	РазмерШрифта         	= 35;
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"magick " 
	+ Путь 
	+ " -pointsize " 
	+ РазмерЗаголовка 
	+ " -gravity Center -fill white -font Sylfaen  -annotate +0+50 '" 
	+ ТекстА 
	+"' "
	+ Путь
	+ Символы.ПС
	+"magick "
	+ Путь
	+ " -pointsize "
	+ РазмерШрифта
	+" -gravity Center -fill gray -font Tahoma -annotate +0+250 '"
	+ ТекстБ
	+ "' "
	+ Путь
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
КонецПроцедуры

Процедура Метод_ОсновнойТекстПритчи(Знач ТекстА, Знач Путь);

	РазмерЗаголовка			= 84;
	РазмерШрифта         	= 30;
	ОграничениеПоСимволам 	= 54;
	
	Текст = СтрЗаменить(ТекстА, "¶", " \n ");
	Текст = СтрЗаменить(Текст, Символы.ПС, " \n ");
	Текст = СтрРазделить(Текст, " ", Ложь);
	ТекстСтрокой 	= "";
	ЧастьТекста		= "";
	Н 				= 0;
	
	Для Н = 0 По Текст.ВГраница() - 1 Цикл
		
		Если Текст[Н] = "\n" Тогда
			ТекстСтрокой = ТекстСтрокой + Текст[Н];
			ЧастьТекста = "";
			Продолжить;
		КонецЕсли;
		
		ТекстСтрокой = ТекстСтрокой + Текст[Н] + " ";
		ЧастьТекста  = ЧастьТекста 	+ Текст[Н] + " ";
		
		Если СтрДлина(ЧастьТекста + Текст[Н + 1]) > ОграничениеПоСимволам Тогда
			ТекстСтрокой = ТекстСтрокой + "\n";
			ЧастьТекста  = "";
		КонецЕсли;
		
	КонецЦикла;		
	
	ТекстСтрокой = ТекстСтрокой + Текст[Текст.ВГраница()];
	
	ИмяСкрипта				= ПолучитьИмяВременногоФайла(".ps1");
	ТекстСкрипта			= Новый ТекстовыйДокумент();
	ТекстСкрипта.УстановитьТекст(
	
	"magick "
	+ Путь
	+ " -pointsize "
	+ РазмерШрифта
	+" -gravity Center -fill white -font Tahoma -annotate +0+0 '"
	+ ТекстСтрокой
	+ "' "
	+ Путь
	);
	
	ТекстСкрипта.Записать(ИмяСкрипта, КодировкаТекста.UTF8);
	
	
	КодВозврата = 0;
	ЗапуститьПриложение("powershell -file " + ИмяСкрипта + " -noexit", ,Истина, КодВозврата);
	
	УдалитьФайлы(ИмяСкрипта);
	
КонецПроцедуры