
&НаСервере
Процедура СоздатьНаСервере()
	Объект.ВК_Альбом = ВК_Действия.СоздатьАльбом(Объект.Наименование, Объект.Описание, Объект.Сообщество);
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере();
	АльбомПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ВК_АльбомПриИзменении(Элемент)
	
	АльбомПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура АльбомПриИзменении()
	
	Если ЗначениеЗаполнено(Объект.ВК_Альбом) Тогда
		Элементы.Создать.Доступность = Ложь;
	Иначе
		Элементы.Создать.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры
